Repository: kaplanlior/debian-installer
Catalog: manual/po/*/boot-installer.po
Languages: da

source: The second, more flexible option is to specify <literal>language</literal> and <literal>country</literal> separately. In this case <literal>locale</literal> can optionally be added to specify a specific default locale for the installed system. Example: <userinput>language=en country=DE locale=en_GB.UTF-8</userinput>.
da: Den anden, mere fleksible indstilling er at angive <literal>sprog</literal> og <literal>land</literal> adskilt. I dette tilfælde kan <literal>sted</literal> valgfrit tilføjes for at angive et specifikt standardsted for det installerede system. Eksempel: <userinput>language=en country=DE locale=en_GB.UTF-8</userinput>.

source: anna/choose_modules (modules)
da: anna/choose_modules (moduler)

source: Can be used to automatically load installer components that are not loaded by default. Examples of optional components that may be useful are <classname>openssh-client-udeb</classname> (so you can use <command>scp</command> during the installation)<phrase arch="not-s390"> and <classname>ppp-udeb</classname> (see <xref linkend="pppoe"/>)</phrase>.
da: Kan bruges til automatisk at indlæse installationskomponenter, som ikke indlæses som standard. Eksempler på valgfrie komponenter, som kan være nyttige er <classname>openssh-client-udeb</classname> (så du kan bruge <command>scp</command> under installationen)<phrase arch="not-s390"> og <classname>ppp-udeb</classname> (se <xref linkend="pppoe"/>)</phrase>.

source: mirror/protocol (protocol)
da: mirror/protocol (protokol)

source: By default the installer will use the http protocol to download files from &debian; mirrors and changing that to ftp is not possible during installations at normal priority. By setting this parameter to <userinput>ftp</userinput>, you can force the installer to use that protocol instead. Note that you cannot select an ftp mirror from a list, you have to enter the hostname manually.
da: Som standard vil installationsprogrammet bruge http-protokollen til at hente filer fra &debian;-spejle og ændring af dette til ftp er ikke muligt under installationer med normal prioritet. Ved at angive denne parameter til <userinput>ftp</userinput>, så kan du tvinge installationsprogrammet til at bruge den protokol i stedet for. Bemærk at du ikke kan vælge et ftp-spejl fra en liste, du skal indtaste værtsnavnet manuelt.

source: tasksel:tasksel/first (tasks)
da: tasksel:tasksel/first (opgaver)

source: Can be used to select tasks that are not available from the interactive task list, such as the <literal>kde-desktop</literal> task. See <xref linkend="pkgsel"/> for additional information.
da: Kan bruges til at vælge opgaver, som ikke er tilgængelige fra den interaktive opgaveliste, såsom opgaven <literal>kde-desktop</literal>. Se <xref linkend="pkgsel"/> for yderligere information.

source: Passing parameters to kernel modules
da: Sende parametre til kernemoduler

source: If drivers are compiled into the kernel, you can pass parameters to them as described in the kernel documentation. However, if drivers are compiled as modules and because kernel modules are loaded a bit differently during an installation than when booting an installed system, it is not possible to pass parameters to modules as you would normally do. Instead, you need to use a special syntax recognized by the installer which will then make sure that the parameters are saved in the proper configuration files and will thus be used when the modules are actually loaded. The parameters will also be propagated automatically to the configuration for the installed system.
da: Hvis drivere er kompileret ind i kernen, så kan du sende parametre til dem som beskrevet i kernedokumentationen. Dog er det ikke muligt at sende parametre til moduler, som du normalt ville gøre, hvis drivere er kompileret som moduler og fordi kernemoduler indlæses en smule anderledes under installation end under opstart fra et installeret system. I stedet skal du bruge en speciel syntaks der genkendes af installationsprogrammet, som så vil sikre at parametrene er gemt i de korrekte konfigurationsfiler og vil derfor blive brugt når modulerne rent faktisk indlæses. Parametrene vil også automatisk blive videregivet til konfigurationen for det installerede system.

source: Note that it is now quite rare that parameters need to be passed to modules. In most cases the kernel will be able to probe the hardware present in a system and set good defaults that way. However, in some situations it may still be needed to set parameters manually.
da: Bemærk at det er ret sjældent at parametere skal sendes til moduler. I de fleste tilfælde vil kernen kunne finde frem til udstyret i et system og angive gode standarder via denne metode. I nogle situationer kan det dog være nødvendigt at angive parametre manuelt.

source: The syntax to use to set parameters for modules is: <informalexample><screen> <replaceable>module_name</replaceable>.<replaceable>parameter_name</replaceable>=<replaceable>value</replaceable> </screen></informalexample> If you need to pass multiple parameters to the same or different modules, just repeat this. For example, to set an old 3Com network interface card to use the BNC (coax) connector and IRQ 10, you would pass:
da: Syntaksen for brug af modulparametre er: <informalexample><screen> <replaceable>module_name</replaceable>.<replaceable>parameter_name</replaceable>=<replaceable>value</replaceable> </screen></informalexample> Hvis du skal sende flere parametre til den samme eller forskellige moduler, så gentag bare dette. For eksmepel, for at angive at et gammelt 3Com-netværksgrænsefladekort skal bruge BNC-forbindelsen (coax) og IRQ 10, skal du skrive:

source: Blacklisting kernel modules
da: Sortliste kernemoduler

source: Sometimes it may be necessary to blacklist a module to prevent it from being loaded automatically by the kernel and udev. One reason could be that a particular module causes problems with your hardware. The kernel also sometimes lists two different drivers for the same device. This can cause the device to not work correctly if the drivers conflict or if the wrong driver is loaded first.
da: Undertiden kan det være nødvendigt at sortliste et modul for at forhindre det i at blive indlæst automatisk af kernen og udev. En årsag kunne være at et specifik modul medfører problemer med dit udstyr. Kernen viser også undertiden to forskellige drivere for den samme enhed. Dette kan medføre at enheden ikke fungerer korrekt, hvis driverne er i konflikt eller hvis den forkerte driver indlæses først.

source: You can blacklist a module using the following syntax: <userinput><replaceable>module_name</replaceable>.blacklist=yes</userinput>. This will cause the module to be blacklisted in <filename>/etc/modprobe.d/blacklist.local</filename> both during the installation and for the installed system.
da: Du kan sortliste et modul med den følgende syntaks: <userinput><replaceable>modulnavn</replaceable>.blacklist=yes</userinput>. Dette vil gøre, at modulet bliver sortlistet i <filename>/etc/modprobe.d/blacklist.local</filename> både under installationen og for det installerede system.

source: Note that a module may still be loaded by the installation system itself. You can prevent that from happening by running the installation in expert mode and unselecting the module from the list of modules displayed during the hardware detection phases.
da: Bemærk at et modul stadig kan blive indlæst af selve installationssystemet. Du kan forhindre dette i at ske ved at køre installationen i eksperttilstand og fravælge modulet fra listen over moduler vist under detektionsfaserne for udstyret.

source: Troubleshooting the Installation Process
da: Fejlsøgning af installationsprocessen

source: CD-ROM Reliability
da: Cd-rom-troværdighed

source: Sometimes, especially with older CD-ROM drives, the installer may fail to boot from a CD-ROM. The installer may also &mdash; even after booting successfully from CD-ROM &mdash; fail to recognize the CD-ROM or return errors while reading from it during the installation.
da: Undertiden, specielt med ældre cd-rom-drev, vil installationsprogrammet fejle i at starte op fra en cd-rom. Installationsprogrammet kan også &mdash; selv efter opstart fra cd-rom &mdash; mislykkes i at genkende cd-rommen eller returnere fejl under læsning fra den under installationen.

source: There are many different possible causes for these problems. We can only list some common issues and provide general suggestions on how to deal with them. The rest is up to you.
da: Der er mangle forskellige mulige årsager for disse problemer. Vi kan kun vise nogle gængse problemstillinger og tilbyde generelle forslag til hvordan du håndterer dem. Resten er op til dig.

source: There are two very simple things that you should try first.
da: Der er to meget simple metoder, du bør prøve først.

source: If the CD-ROM does not boot, check that it was inserted correctly and that it is not dirty.
da: Hvis cd-rommen ikke starter op, så kontroller at disken er korrekt indsat og at den ikke er ridset eller beskidt.

source: If the installer fails to recognize a CD-ROM, try just running the option <menuchoice> <guimenuitem>Detect and mount CD-ROM</guimenuitem> </menuchoice> a second time. Some DMA related issues with very old CD-ROM drives are known to be resolved in this way.
da: Hvis installationsprogrammet ikke kan genkende en cd-rom, så prøv at køre indstillingen <menuchoice> <guimenuitem>Detekter og monter cd-rom</guimenuitem> </menuchoice> endnu en gang. Nogle DMA-relaterede problemstillinger med meget gamle cd-rom-drev kan løses på denne måde.

source: If this does not work, then try the suggestions in the subsections below. Most, but not all, suggestions discussed there are valid for both CD-ROM and DVD, but we'll use the term CD-ROM for simplicity.
da: Hvis dette ikke virker, så prøv forslagene i underafsnittene nedenfor. De fleste - men ikke alle - forslag diskuteret her er gyldige for både cd-rom og dvd, men vi bruger alene udtrykket cd-rom.

source: If you cannot get the installation working from CD-ROM, try one of the other installation methods that are available.
da: Hvis du ikke kan få installationen til at virke fra cd-rom, så prøv en af de andre tilgængelige installationsmetoder.

source: Common issues
da: Gængse problemstillinger

source: Some older CD-ROM drives do not support reading from discs that were burned at high speeds using a modern CD writer.
da: Nogle ældre cd-rom-drev understøtter ikke læsning fra diske som blev brændt med høje hastigheder via et moderne cd-rom-drev.

source: Some very old CD-ROM drives do not work correctly if <quote>direct memory access</quote> (DMA) is enabled for them.
da: Nogle meget gamle cd-rom-drev virker ikke korrekt hvis <quote>direct memory access</quote> (DMA) er aktiveret for dem.

source: How to investigate and maybe solve issues
da: Hvordan kan der undersøges og måske løses problemstillinger

source: If the CD-ROM fails to boot, try the suggestions listed below.
da: Hvis cd-rom'en ikke starter op, så prøv anbefalingerne på listen nedenfor.

source: Check that your BIOS actually supports booting from CD-ROM (only an issue for very old systems) and that CD booting is enabled in the BIOS.
da: Kontroller at din BIOS rent faktisk understøtter opstart fra cd-rom (kun en problemstilling for meget gamle systemer) og at cd-opstart er aktiveret i BIOS'en.

source: If you downloaded an iso image, check that the md5sum of that image matches the one listed for the image in the <filename>MD5SUMS</filename> file that should be present in the same location as where you downloaded the image from. <informalexample><screen> $ md5sum <replaceable>debian-testing-i386-netinst.iso</replaceable> a20391b12f7ff22ef705cee4059c6b92 <replaceable>debian-testing-i386-netinst.iso</replaceable> </screen></informalexample> Next, check that the md5sum of the burned CD-ROM matches as well. The following command should work. It uses the size of the image to read the correct number of bytes from the CD-ROM.
da: Hvis du hentede et iso-aftryk, så kontroller at md5summen for det aftryk matcher det viste aftryk i filen <filename>MD5SUMS</filename>, som bør befinde sig samme sted, som du hentede aftrykket fra. <informalexample><screen> $ md5sum <replaceable>debian-testing-i386-netinst.iso</replaceable> a20391b12f7ff22ef705cee4059c6b92 <replaceable>debian-testing-i386-netinst.iso</replaceable> </screen></informalexample> Derefter kontrollerer du at md5summen for den brændte cd-rom også matcher. Den følgende kommando bør virke. Den bruger størrelsen for aftrykket til at læse det korrekte antal byte fra cd-rommen.

source: $ dd if=/dev/cdrom | \ > head -c `stat --format=%s <replaceable>debian-testing-i386-netinst.iso</replaceable>` | \ > md5sum a20391b12f7ff22ef705cee4059c6b92 - 262668+0 records in 262668+0 records out 134486016 bytes (134 MB) copied, 97.474 seconds, 1.4 MB/s
da: > head -c `stat --format=%s <replaceable>debian-testing-i386-netinst.iso</replaceable>` | \ > md5sum a20391b12f7ff22ef705cee4059c6b92 - 262668+0 poster ind 262668+0 poster ud 134486016 byte (134 MB) kopieret, 97,474 sekunder, 1,4 MB/s

source: If, after the installer has been booted successfully, the CD-ROM is not detected, sometimes simply trying again may solve the problem. If you have more than one CD-ROM drive, try changing the CD-ROM to the other drive. If that does not work or if the CD-ROM is recognized but there are errors when reading from it, try the suggestions listed below. Some basic knowledge of &arch-kernel; is required for this. To execute any of the commands, you should first switch to the second virtual console (VT2) and activate the shell there.
da: Hvis, efter at installationsprogrammet er blevet korrekt startet, cd-rommen ikke detekteres, så kan det bare at prøve igen nogle gange løse problemet. Hvis du har mere end et cd-rom-drev, så prøv at indsætte disken i det andet drev. Hvis det ikke virker eller hvis diske genkendes men har fejl under læsning, så prøv forslagene nedenfor. Lidt grundlæggende viden om &arch-kernel; er krævet for dette. For at køre disse kommandoer, så skal du først skifte til den anden virtuelle konsol (VT2) og aktivere skallen der.

source: Switch to VT4 or view the contents of <filename>/var/log/syslog</filename> (use <command>nano</command> as editor) to check for any specific error messages. After that, also check the output of <command>dmesg</command>.
da: Skift til VT4 eller vis indholdet af <filename>/var/log/syslog</filename> (brug <command>nano</command> som redigeringsprogram) til at kontrollere efter specifikke fejlbeskeder. Derefter kontrolleres også resultatet af <command>dmesg</command>.

source: Check in the output of <command>dmesg</command> if your CD-ROM drive was recognized. You should see something like (the lines do not necessarily have to be consecutive): <informalexample><screen> Probing IDE interface ide1... hdc: TOSHIBA DVD-ROM SD-R6112, ATAPI CD/DVD-ROM drive ide1 at 0x170-0x177,0x376 on irq 15 hdc: ATAPI 24X DVD-ROM DVD-R CD-R/RW drive, 2048kB Cache, UDMA(33) Uniform CD-ROM driver Revision: 3.20 </screen></informalexample> If you don't see something like that, chances are the controller your CD-ROM is connected to was not recognized or may be not supported at all. If you know what driver is needed for the controller, you can try loading it manually using <command>modprobe</command>.
da: Kontroller i resultatet fra <command>dmesg</command> om dit cd-rom-drev blev genkendt. Du bør se noget ala (linjerne skal ikke nødvendigvis være fortløbende): <informalexample><screen> Probing IDE interface ide1... hdc: TOSHIBA DVD-ROM SD-R6112, ATAPI CD/DVD-ROM drive ide1 at 0x170-0x177,0x376 on irq 15 hdc: ATAPI 24X DVD-ROM DVD-R CD-R/RW drive, 2048kB Cache, UDMA(33) Uniform CD-ROM driver Revision: 3.20 </screen></informalexample> Hvis du ikke ser noget der ligner eksemplet, er der en risiko for, at controlleren som dit cd-rom-drev er forbundet med ikke blev genkendt eller slet ikke er understøttet. Hvis du ved hvilken driver, der er krævet for controlleren, så kan du forsøge at indlæse den manuelt med <command>modprobe</command>.

source: Check that there is a device node for your CD-ROM drive under <filename>/dev/</filename>. In the example above, this would be <filename>/dev/hdc</filename>. There should also be a <filename>/dev/cdrom</filename>.
da: Kontroller at der er en enhedsknude for dit cd-rom-drev under <filename>/dev/</filename>. I eksemplet ovenfor, skal dette være <filename>/dev/hdc</filename>. Der skal også være et <filename>/dev/cdrom</filename>.

source: Use the <command>mount</command> command to check if the CD-ROM is already mounted; if not, try mounting it manually: <informalexample><screen> $ mount /dev/<replaceable>hdc</replaceable> /cdrom </screen></informalexample> Check if there are any error messages after that command.
da: Brug kommandoen <command>mount</command> til at kontrollere om cd-rommen allerede er monteret; hvis ikke, så prøv at montere den manuelt: <informalexample><screen> $ mount /dev/<replaceable>hdc</replaceable> /cdrom </screen></informalexample> Kontroller hvis der er nogle fejlbeskeder efter den kommando.

source: Check if DMA is currently enabled: <informalexample><screen> $ cd /proc/<replaceable>ide</replaceable>/<replaceable>hdc</replaceable> $ grep using_dma settings using_dma 1 0 1 rw </screen></informalexample> A <quote>1</quote> in the first column after <literal>using_dma</literal> means it is enabled. If it is, try disabling it: <informalexample><screen> $ echo -n "using_dma:0" >settings </screen></informalexample> Make sure that you are in the directory for the device that corresponds to your CD-ROM drive.
da: Kontroller hvis DMA er aktuelt aktiveret: <informalexample><screen> $ cd /proc/<replaceable>ide</replaceable>/<replaceable>hdc</replaceable> $ grep using_dma settings using_dma 1 0 1 rw </screen></informalexample> Et <quote>1</quote> i den første kolonne efter <literal>using_dma</literal> betyder at den er aktiveret. Hvis den er, så prøv at deaktivere den: <informalexample><screen> $ echo -n "using_dma:0" >settings </screen></informalexample> Sikr dig at du er i mappen for enheden som svarer til dit cd-rom-drev.

source: If there are any problems during the installation, try checking the integrity of the CD-ROM using the option near the bottom of the installer's main menu. This option can also be used as a general test if the CD-ROM can be read reliably.
da: Hvis der er problemer under installationen, så prøv at kontrollere integriteten for cd-rommen med indstillingen nær bunden af installationsprogrammets hovedmenu. Denne indstilling kan også bruges som en generel test af, om cd-rommen kan læses troværdigt.

source: Floppy Disk Reliability
da: Troværdighed for disketter

source: The biggest problem for people using floppy disks to install &debian; seems to be floppy disk reliability.
da: Det største problem for folk der bruger disketter til at installere &debian; ser ud til at være disketternes troværdighed.

source: The boot floppy is the floppy with the worst problems, because it is read by the hardware directly, before Linux boots. Often, the hardware doesn't read as reliably as the Linux floppy disk driver, and may just stop without printing an error message if it reads incorrect data. There can also be failures in the driver floppies, most of which indicate themselves with a flood of messages about disk I/O errors.
da: Opstartsdisketten er disketten med de største problemer, da den læses af udstyret direkte, før Linux starter op. Ofte læser udstyret ikke lige så troværdigt som diskettedriveren for Linux, og kan bare stoppe uden at vise en fejlbesked, hvis den læser ukorrekte data. Der kan også være fejl i driverdisketterne, hvor de fleste fejl viser sig som en stor mængde af I/O-fejl.

source: If you are having the installation stall at a particular floppy, the first thing you should do is write the image to a <emphasis>different</emphasis> floppy and see if that solves the problem. Simply reformatting the old floppy may not be sufficient, even if it appears that the floppy was reformatted and written with no errors. It is sometimes useful to try writing the floppy on a different system.
da: Hvis installationen stopper med en specifik diskette, er den første ting du skal gøre at skrive aftrykket til en <emphasis>anden</emphasis> diskette og se om dette løser problemet. En formatering af den gamle diskette er måske ikke nok, også selv om det ser ud til at disketten blev formateret og skrevet uden fejl. Det er undertiden nyttigt at prøve at skrive disketten på et andet system.

source: One user reports he had to write the images to floppy <emphasis>three</emphasis> times before one worked, and then everything was fine with the third floppy.
da: En bruger indrapporterede at han skulle skrive aftrykket til disketten <emphasis>tre</emphasis> gange før der var en der virkede, og så var alt okay med den tredje diskette.

source: Normally you should not have to download a floppy image again, but if you are experiencing problems it is always useful to verify that the images were downloaded correctly by verifying their md5sums.
da: Normalt skal du ikke hente en disketteaftryk igen, men hvis du oplever problemer er det altid nyttigt at verificere at aftrykkene blev hentet korrekt ved at verificere deres md5summer.

source: Other users have reported that simply rebooting a few times with the same floppy in the floppy drive can lead to a successful boot. This is all due to buggy hardware or firmware floppy drivers.
da: Andre brugere har indrapporteret at simple genstarter over et par gange med den samme diskette i drevet kan føre til en succesfuld opstart. Dette skyldes fejlramt udstyr eller firmware i diskettedrevene.

source: Boot Configuration
da: Opstartskonfiguration

source: If you have problems and the kernel hangs during the boot process, doesn't recognize peripherals you actually have, or drives are not recognized properly, the first thing to check is the boot parameters, as discussed in <xref linkend="boot-parms"/>.
da: Hvis du har problemer og kernen hænger under opstartsprocessen, ikke genkender perifære enheder du rent faktisk har, eller driverne ikke bliver genkendt korrekt, så er den første ting du skal gøre er at kontrollere opstartsparametrene, som omtalt i <xref linkend="boot-parms"/>.

source: In some cases, malfunctions can be caused by missing device firmware (see <xref linkend="hardware-firmware"/> and <xref linkend="loading-firmware"/>).
da: I nogle tilfælde kan fejlsituationer opstå på grund af manglende firmware for udstyr (se <xref linkend="hardware-firmware"/> og <xref linkend="loading-firmware"/>).

source: If software speech synthesis does not work, there is most probably an issue with your sound board, usually because either the driver for it is not included in the installer, or because it has unusual mixer level names which are set to muted by default. You should thus submit a bug report which includes the output of the following commands, run on the same machine from a Linux system which is known to have sound working (e.g., a live CD).
da: Hvis talesyntese for programmer ikke virker, så er der sandsynligvis et problem med dit lydkort, normalt på grund af at enten drivere for den ikke er inkluderet i installationsprogrammet, eller fordi den har et unormalt navn for mikserniveauet som er sat til slukket som standard. Du skal derfor indsende en fejlraport som inkluderer resultatet fra de følgende kommandoer, kørt på den samme maskine fra et Linuxsystem som vides at have lyd virkende (dvs. en live-cd).

source: Common &arch-title; Installation Problems
da: Gængse &arch-title;-installationsproblemer
