Repository: kaplanlior/debian-installer
Catalog: manual/po/*/boot-installer.po
Languages: da

source: After booting from the boot floppy, the root floppy is requested. Insert the root floppy and press &enterkey;, and the contents are loaded into memory. The installer program <command>debian-installer</command> is automatically launched.
da: Efter opstart fra disketten, bliver du anmodt om root-diskken. Indsæt root-disketten og tryk &enterkey;, og indholdet læses ind i hukommelsen. Installationsprogrammet <command>debian-installer</command> igangsættes automatisk.

source: Booting with TFTP
da: Opstart med TFTP

source: There are various ways to do a TFTP boot on i386.
da: Der er forskellige måder at udføre en TFTP-opstart på i386.

source: NIC or Motherboard that support PXE
da: NIC eller bundkort som understøtter PXE

source: It could be that your Network Interface Card or Motherboard provides PXE boot functionality. This is a <trademark class="trade">Intel</trademark> re-implementation of TFTP boot. If so, you may be able to configure your BIOS to boot from the network.
da: Det kan være at dit netværkskort eller bundkort tilbyder en PXE-opstartsfunktion. Dette er en <trademark class="trade">Intel</trademark>-reimplementering af TFTP-opstart. Hvis det er tilfældet kan du måske konfigurere din BIOS til at starte op fra netværket.

source: NIC with Network BootROM
da: NIC med netværks-BootROM

source: It could be that your Network Interface Card provides TFTP boot functionality.
da: Det kan være at dit netværkskort tilbyder TFTP-opstartfunktionalitet.

source: Let us (<email>&email-debian-boot-list;</email>) know how did you manage it. Please refer to this document.
da: Lad os (<email>&email-debian-boot-list;</email>) høre om hvordan du håndterede det. Henvis til dette dokument.

source: The <ulink url="http://www.etherboot.org">etherboot project</ulink> provides bootdiskettes and even bootroms that do a TFTPboot.
da: <ulink url="http://www.etherboot.org">Etherbootprojektet</ulink> tilbyder opstartsdisketter og endda bootrom'er som udfører en TFTPboot.

source: The Boot Screen
da: Opstartsskærmen

source: When the installer boots, you should be presented with a friendly graphical screen showing the &debian; logo and a menu: <informalexample><screen> Installer boot menu Install Graphical install Advanced options > Help Install with speech synthesis Press ENTER to boot or TAB to edit a menu entry </screen></informalexample> Depending on the installation method you are using, the <quote>Graphical install</quote> option may not be available. Bi-arch images additionally have a 64 bit variant for each install option, right below it, thus almost doubling the number of options.
da: Når installationsprogrammet starter op, bliver du præsenteret for en venlig grafisk skræm, der viser &debian;s logo og en menu: <informalexample><screen> Installer boot menu Install Graphical install Advanced options > Help Install with speech synthesis Tryk RETUR for at starte op eller TAB for at redigere et menupunkt </screen></informalexample> Afhængig af den valgte installationsmetode, kan <quote>Graphical install</quote> mangle. Flerarkitekturaftryk har desuden en 64-bit-variant for hver installationsmulighed, lige nedenfor, hvilket næsten fordobler antallet af muligheder.

source: For a normal installation, select either the <quote>Install</quote> or the <quote>Graphical install</quote> entry &mdash; using either the arrow keys on your keyboard or by typing the first (highlighted) letter, the <quote>Install</quote> entry is already selected by default &mdash; and press &enterkey; to boot the installer.
da: For en normal installation, vælg enten punktet <quote>Installer</quote> eller <quote>Grafisk installation</quote> &mdash; med brug af enten piletasterne på dit tastatur eller ved at indtaste det første (fremhævede) bogstav, punktet <quote>Installer</quote> er allerede valgt som standard &mdash; og tryk på &enterkey; for at opstarte installationsprogrammet.

source: The <quote>Advanced options</quote> entry gives access to a second menu that allows to boot the installer in expert mode, in rescue mode and for automated installs.
da: Punktet <quote>Avancerede indstillinger</quote> giver adgang til en anden menu, som giver mulighed for at opstarte installationsprogrammet i tilstanden ekspert, i redningstilstand og for automatiserede installationer.

source: If you wish or need to add any boot parameters for either the installer or the kernel, press &tabkey;. This will display the default boot command for the selected menu entry and allow to add additional options. The help screens (see below) list some common possible options. Press &enterkey; to boot the installer with your options; pressing &escapekey; will return you to the boot menu and undo any changes you made.
da: Hvis du ønsker eller har brug for at tilføje opstartsparametre for enten installationsprogrammet ellre kernen, så tryk &tabkey;. Dette vil vise den normale opstartskommando for det valgte menupunkt og give mulighed for at tilføje yderligere indstillinger. Hjælpeskærmene (se nedenfor) viser nogle gængse indstillingsmuligheder. Tryk &enterkey; for at starte installationsprogrammet op med dine indstillinger; et tryk på &escapekey; vil returnere dig til opstartsmenuen og omgøre eventuelle ændringer du har foretaget.

source: Choosing the <quote>Help</quote> entry will result in the first help screen being displayed which gives an overview of all available help screens. To return to the boot menu after the help screens have been displayed, type 'menu' at the boot prompt and press &enterkey;. All help screens have a boot prompt at which the boot command can be typed: <informalexample><screen> Press F1 for the help index, or ENTER to boot: </screen></informalexample> At this boot prompt you can either just press &enterkey; to boot the installer with default options or enter a specific boot command and, optionally, boot parameters. A number of boot parameters which might be useful can be found on the various help screens. If you do add any parameters to the boot command line, be sure to first type the boot method (the default is <userinput>install</userinput>) and a space before the first parameter (e.g., <userinput>install fb=false</userinput>).
da: Valg af punktet <quote>Hjælp</quote> vil resultere i at den første hjælpeskærm bliver vist, hvilket giver et overblik over alle tilgængelige hjælpeskærme. For at returnere til opstartsmenuen efter at hjælpeskærmene er blevet vist, så tast »menu« ved opstartsprompten og tryk på &enterkey;. Alle hjælpeskærme har en opstartsprompt hvor opstartskommandoen kan indtastes: <informalexample><screen> Tryk F1 for hjælpeindeks, eller RETUR for at starte op: </screen></informalexample> Ved denne opstartsprompt kan du enten bare trykke &enterkey; for at igangsætte opstartsprogrammet med standardindstillinger eller indtaste en specifik opstartskommando og - valgfrit - opstartsparametre. Et antal opstartsparametere som kan være nyttige kan findes på de forskellige hjælpeskærme. Hvis du tilføjer parametre til opstartskommandolinjen, så være sikker på først at indtaste opstartsmetoden (standarden er <userinput>install</userinput>) og et mellemrum før den første parameter (f.eks. <userinput>install fb=false</userinput>).

source: The keyboard is assumed to have a default American English layout at this point. This means that if your keyboard has a different (language-specific) layout, the characters that appear on the screen may be different from what you'd expect when you type parameters. Wikipedia has a <ulink url="&url-us-keymap;">schema of the US keyboard layout</ulink> which can be used as a reference to find the correct keys to use.
da: Tastaturet antages at have det normale amerikansk-engelske layout på dette tidspunkt. Dette betyder at hvis dit tastatur har et andet (sprogspecifik) layout, kan tegnene som skrives på skærmen være forskellige fra hvad du forventer, når du indtaster parametere. Wikipedia har et <ulink url="&url-us-keymap;">skema for US-tastaturlayout</ulink>, som kan bruges som en reference til at finde de korrekte taster.

source: If you are using a system that has the BIOS configured to use serial console, you may not be able to see the initial graphical splash screen upon booting the installer; you may even not see the boot menu. The same can happen if you are installing the system via a remote management device that provides a text interface to the VGA console. Examples of these devices include the text console of Compaq's <quote>integrated Lights Out</quote> (iLO) and HP's <quote>Integrated Remote Assistant</quote> (IRA).
da: Hvis du bruger et sytsem som har BIOS'en konfigureret til at bruge seriel konsol, så kan du måske se den grafiske opstartsskærm før installationsprogrammet indlæses; du ser måske slet ikke opstartsmenuen. Det samme kan ske hvis du installerer systemet via en ekstern håndteringsenhed, som tilbyder en tekstgrænseflade til VGA-konsollen. Eksempler på disse enheder inkluderer tekstkonsollen for Compaqs <quote>integrated Lights Out</quote> (iLO) og HP's <quote>Integrated Remote Assistant</quote> (IRA).

source: To bypass the graphical boot screen you can either blindly press &escapekey; to get a text boot prompt, or (equally blindly) press <quote>H</quote> followed by &enterkey; to select the <quote>Help</quote> option described above. After that your keystrokes should be echoed at the prompt. To prevent the installer from using the framebuffer for the rest of the installation, you will also want to add <userinput>vga=normal fb=false</userinput> to the boot prompt, as described in the help text.
da: For at forbigå den grafiske opstartsskærm kan du enten blindt indtaste &escapekey; for at få en tekstopstartsprompt, eller (lige så blindt) taste <quote>H</quote> efterfulgt af &enterkey; for at vælge indstillingen <quote>Hjælp</quote> beskrevet ovenfor. Herefter bør dine tastaturtryk blive gengivet på prompten. For at forhindre installationsprogramet i at bruge framebufferen i resten af installationen, skal du også tilføje <userinput>vga=normal fb=false</userinput> til opstartsprompten, som beskrevet i hjælpeteksten.

source: CD Contents
da: Cd-indhold

source: There are three basic variations of &debian; Install CDs. The <emphasis>Business Card</emphasis> CD has a minimal installation that will fit on the small form factor CD media. It requires a network connection in order to install the rest of the base installation and make a usable system. The <emphasis>Network Install</emphasis> CD has all of the packages for a base install but requires a network connection to a &debian; mirror site in order to install the extra packages one would want for a complete system . The set of &debian; CDs can install a complete system from the wide range of packages without needing access to the network.
da: Der er tre grundlæggende variationer af installations-cd'er for &debian;. <emphasis>Forretningskort</emphasis>-cd'en har en minimal installation, som vil passe på det lille form factor cd-medie. Det kræver et netværksforbindelse for at installere resten af det grundlæggende installation og få et brugbart system. <emphasis>Netværksinstallations</emphasis>-cd'en har alle pakkerne for en grundlæggende installation men kræver en netværksforbindelse til en &debian;-spejlside for at installere ekstra pakker der kan udgøre et fuldstændigt system. Sættet af &debian;-cd'er kan installere et fuldstændig system fra det brede udvalg af apkker uden at kræve adgang til netværket.

source: The IA-64 architecture uses the next generation Extensible Firmware Interface (EFI) from Intel. Unlike the traditional x86 BIOS which knows little about the boot device other than the partition table and Master Boot Record (MBR), EFI can read and write files from FAT16 or FAT32 formatted disk partitions. This simplifies the often arcane process of starting a system. The system boot loader and the EFI firmware that supports it have a full filesystem to store the files necessary for booting the machine. This means that the system disk on an IA-64 system has an additional disk partition dedicated to EFI instead of the simple MBR or boot block on more conventional systems.
da: IA-64-arkitekturen bruger den næste generations Extensible Firmware Interface (EFI) fra Intel. Til forskel fra den traditionelle x86 BIOS, som ikke kender meget til opstartsenheden udover partitionstabellen og Master Boot Record (MBR), kan EFI læse og skrive filer fra FAT16 eller FAT32-formatterede diskpartitioner. Dette forenkler den ofte omfangsrige proces ved at starte et system. Systemets opstartsindlæser og EFI-firmwaren som understøtter den har et fuldt filsystem til at gemme de nødvendige filer for opstart af maskinen. Dette betyder at systemdisken på et IA-64-system har en yderligere diskpartiiton dedikeret til EFI i stedet for den simple MBR eller opstartsblok for mere konventionelle systemer.

source: The &debian; Installer CD contains a small EFI partition where the <command>ELILO</command> bootloader, its configuration file, the installer's kernel, and initial filesystem (initrd) are located. The running system also contains an EFI partition where the necessary files for booting the system reside. These files are readable from the EFI Shell as described below.
da: &debian;-installations-cd'en indeholder en lille EFI-partition hvor <command>ELILO</command>-opstartsindlæseren, dens konfigurationsfil, installationsprogrammets kerne og det oprindelige filsystem (initrd) er placeret. Det kørende system indeholder også en EFI-partition hvor de nødvendige filer for opstart af systemet befinder sig. Disse filer er læsbare fra EFI-skallen som beskrevet nedenfor.

source: Most of the details of how <command>ELILO</command> actually loads and starts a system are transparent to the system installer. However, the installer must set up an EFI partition prior to installing the base system. Otherwise, the installation of <command>ELILO</command> will fail, rendering the system un-bootable. The EFI partition is allocated and formatted in the partitioning step of the installation prior to loading any packages on the system disk. The partitioning task also verifies that a suitable EFI partition is present before allowing the installation to proceed.
da: De fleste detaljer om hvordan <command>ELILO</command> faktisk indlæser og starter et system er gennemsigtige for systemets installationsprogram. Installationsprogrammet skal dog opsætte en EFI-partition før det grundlægende system installeres. Ellers vil installationen af <command>ELILO</command> mislykkes, og medføre at systemet ikke kan startes op. EFI-partitionen er placeret og formateret i partitioneringstrinet for installationen før der indlæses pakker på systemdisken. Partitioneringsopgaven verificerer også at en egnet EFI-partition er til stede før installationen får lov til at fortsætte.

source: The EFI Boot Manager is presented as the last step of the firmware initialization. It displays a menu list from which the user can select an option. Depending on the model of system and what other software has been loaded on the system, this menu may be different from one system to another. There should be at least two menu items displayed, <command>Boot Option Maintenance Menu</command> and <command>EFI Shell (Built-in)</command>. Using the first option is preferred, however, if that option is not available or the CD for some reason does not boot with it, use the second option.
da: EFI-opstartshåndteringen præsenteres ved det sidste trin i firmware-initialiseringen. Den viser en menuliste hvorfra brugeren kan foretage et valg. Afhængig af systemmodellen og hvilke andre programmer der er blevet indlæst på systemet, kan denne menu være forskellig fra et system til et andet. Der skal være mindst to menupunkter vist, <command>Vedligeholdelsesmenu for opstartsindstillinger</command> og <command>EFI-skal (indbygget)</command>. Brug af den første indstilling foretrækkes, hvis denne indstilling ikke er tilgængelig eller cd'en af en eller anden grund ikke starter med den, så brug den anden indstilling.

source: IMPORTANT
da: VIGTIGT

source: The EFI Boot Manager will select a default boot action, typically the first menu choice, within a pre-set number of seconds. This is indicated by a countdown at the bottom of the screen. Once the timer expires and the systems starts the default action, you may have to reboot the machine in order to continue the installation. If the default action is the EFI Shell, you can return to the Boot Manager by running <command>exit</command> at the shell prompt.
da: EFI-opstartshåndteringen vil vælge en standardhandling for opstarten, typisk det første menuvalg, inden for et prædefineret antal sekunder. Dette vises med en nedtælling i bunden af skærmen. Når tidsmåleren udløber og systemet starter standardhandlingen, skal du måske genstarte maskinene for at fortsætte installationen. Hvis standardhandlingen er EFI-skallen, kan du returnere til opstartshåndteirngen ved at køre <command>exit</command> i skalprompten.

source: Option 1: Booting from the Boot Option Maintenance Menu
da: Valg 1: Opstart fra vedligeholdelsesmenuen for opstartsindstillinger

source: Insert the CD in the DVD/CD drive and reboot the machine. The firmware will display the EFI Boot Manager page and menu after it completes its system initialization.
da: Indsæt cd'en i dvd/cd-drevet og genstart maskinen. Firmwaren vil vise siden for EFI-opstartshåndteringen og menuen efter at den færdiggør dets systeminitialisering.

source: Select <command>Boot Maintenance Menu</command> from the menu with the arrow keys and press <command>ENTER</command>. This will display a new menu.
da: Vælg <command>Menu for opstartsvedligeholdelse</command> fra menuen med piletasterne og tryk på <command>RETUR</command>. Dette vil vise en ny menu.

source: Select <command>Boot From a File</command> from the menu with the arrow keys and press <command>ENTER</command>. This will display a list of devices probed by the firmware. You should see two menu lines containing either the label <command>Debian Inst [Acpi ...</command> or <command>Removable Media Boot</command>. If you examine the rest of the menu line, you will notice that the device and controller information should be the same.
da: Vælg <command>Start op fra en fil</command> fra menuen med piletasterne og tryk på <command>RETUR</command>. Dette vil vise en liste over enheder undersøgt af firmwaren. Du bør se to menulinjer der indeholder enten etiketten <command>Debian Inst [Acpi ...</command> eller <command>Eksternt medieopstart</command>. Hvis du undersøger resten af menulinjen, vil du bemærke at enheds- og controllerinformationen bør være ens.

source: You can choose either of the entries that refer to the CD/DVD drive. Select your choice with the arrow keys and press <command>ENTER</command>. If you choose <command>Removable Media Boot</command> the machine will immediately start the boot load sequence. If you choose <command>Debian Inst [Acpi ...</command> instead, it will display a directory listing of the bootable portion of the CD, requiring you to proceed to the next (additional) step.
da: Du kan vælge en af punkterne som refererer til cd/dvd-drevet. Foretag dit valg med piletasterne og tryk på <command>RETUR</command>. Hvis du vælger <command>Eksternt medieopstart</command> så vil maskinen igangsætte opstartsindlæsningssekvensen. Hvis du vælger <command>Debian Inst [Acpi ...</command> i stedet for, så vil den vise en mappe over opstartsdelen af cd'en, hvor det bliver krævet at du fortsætter til næste (yderligere) trin.

source: You will only need this step if you chose <command>Debian Inst [Acpi ...</command>. The directory listing will also show <command>[Treat like Removable Media Boot]</command> on the next to the last line. Select this line with the arrow keys and press <command>ENTER</command>. This will start the boot load sequence.
da: Du skal kun bruge dette trin, hvis du vælger <command>Debian Inst [Acpi ...</command>. Mappevisningen vil også vise <command>[Treat like Removable Media Boot]</command> på den næste til den sidste linje. Vælg denne linje med piletasterne og tryk på <command>RETUR</command>. Dette vil igangsætte opstartssekvensen.

source: These steps start the &debian; boot loader which will display a menu page for you to select a boot kernel and options. Proceed to selecting the boot kernel and options.
da: Disse trin starter &debian;-opstartsindlæseren, som vil vise en menuside hvor du kan vælge en opstartskerne og indstillinger. Fortsæt for at vælge opstartskernen og indstillinger.

source: Option 2: Booting from the EFI Shell
da: Indstilling 2: Opstart fra EFI-skallen

source: If, for some reason, option 1 is not successful, reboot the machine and when the EFI Boot Manager screen appears there should be one option called <command>EFI Shell [Built-in]</command>. Boot the &debian; Installer CD with the following steps:
da: Hvis, af en eller anden årsag, indstilling 1 ikke lykkes, så genstart maskinen og når skærmen for EFI-opstartshåndteringen vises, bør der være en indstilling kaldt <command>EFI Shell [Built-in]</command>. Start &debian;-installations-cd'en med de følgende trin:

source: Insert the CD in the DVD/CD drive and reboot the machine. The firmware will display the EFI Boot Manager page and menu after it completes system initialization.
da: Indsæt cd'en i dvd/cd-drevet og genstart maskinen. Firmwaren vil vise siden og menuen for EFI-opstartshåndteringen efter, at den er færdig med systeminitialiseringen.

source: Select <command>EFI Shell</command> from the menu with the arrow keys and press <command>ENTER</command>. The EFI Shell will scan all of the bootable devices and display them to the console before displaying its command prompt. The recognized bootable partitions on devices will show a device name of <filename>fs<replaceable>n</replaceable>:</filename>. All other recognized partitions will be named <filename>blk<replaceable>n</replaceable>:</filename>. If you inserted the CD just before entering the shell, this may take a few extra seconds as it initializes the CD drive.
da: Vælg <command>EFI Shell</command> fra menuen med piletastesrne og tryk <command>RETUR</command>. EFI-skallen vil skanne alle enheder, der kan startes op fra, og vise dem for konsollen før den viser sin kommandoprompt.De genkendte opstartspartitioner på enheder vi vise et enhedsnavn på <filename>fs<replaceable>n</replaceable>:</filename>. Alle andre genkendte partitioner vil blive navngivet <filename>blk<replaceable>n</replaceable>:</filename>. Hvis du indsættede cd'en lige før du indtastede skallen, så kan dette tage nogle få ekstra sekunder, da den initialiserer c-drevet.

source: Examine the output from the shell looking for the CDROM drive. It is most likely the <filename>fs0:</filename> device although other devices with bootable partitions will also show up as <filename>fs<replaceable>n</replaceable></filename>.
da: Undersøg resultatet fra skallen til du finder cd-rom-drevet. Det er højst sandsynlig enheden <filename>fs0:</filename> selvom andre enheder med opstartspartitioner også vil blive vist som <filename>fs<replaceable>n</replaceable></filename>.

source: Enter <command>fs<replaceable>n</replaceable>:</command> and press <command>ENTER</command> to select that device where <replaceable>n</replaceable> is the partition number for the CDROM. The shell will now display the partition number as its prompt.
da: Indtast <command>fs<replaceable>n</replaceable>:</command> og tryk <command>RETUR</command> for at vælge den enhed hvor <replaceable>n</replaceable> er partitionsnummeret for cd'rommen. Skallen vil nu vise partitionsnummeret som sin prompt.
