Repository: kaplanlior/debian-installer
Catalog: manual/po/*/boot-installer.po
Languages: da

source: Booting the Installation System
da: Opstart af installationssystemet

source: Booting the Installer on &arch-title;
da: Opstart af installationsprogrammet på &arch-title;

source: If you have any other operating systems on your system that you wish to keep (dual boot setup), you should make sure that they have been properly shut down <emphasis>before</emphasis> you boot the installer. Installing an operating system while another operating system is in hibernation (has been suspended to disk) could result in loss of, or damage to the state of the suspended operating system which could cause problems when it is rebooted.
da: Hvis du har andre operativsystemer på din computer, som du ønsker at beholde (via en opstartsmenu), bør du sikre dig, at de er lukket ned på korrekt måde <emphasis>inden</emphasis> du starter installationsprogrammet. Installation af et operativsystem mens et andet operativsystem er i dvale (er blevet suspenderet til disk) kan medføre tab af, eller skade på tilstanden af operativsystemet i dvale, hvilket kan medføre problemer når det bliver genstartet.

source: For information on how to boot the graphical installer, see <xref linkend="graphical"/>.
da: For information om hvordan man starter det grafiske installationsprogram, så se <xref linkend="graphical"/>.

source: Booting from TFTP
da: Opstart fra TFTP

source: Booting from the network requires that you have a network connection and a TFTP network boot server (DHCP, RARP, or BOOTP).
da: Opstart fra netværket kræver at du har en netværksforbindelse og en TFTP-netværksopstartsserver (DHCP, RARP eller BOOTP).

source: Older systems such as the 715 might require the use of an RBOOT server instead of a BOOTP server.
da: Ældre systemer såsom 715 kan kræve brug af en RBOOT-server i stedet for en BOOTP-server.

source: The installation method to support network booting is described in <xref linkend="install-tftp"/>.
da: Installationsmetoden for understøttelse af netværksopstart er beskrevet i <xref linkend="install-tftp"/>.

source: Booting from CD-ROM
da: Opstart fra cd-rom

source: The easiest route for most people will be to use a set of &debian; CDs. If you have a CD set, and if your machine supports booting directly off the CD, great! Simply <phrase arch="x86"> configure your system for booting off a CD as described in <xref linkend="boot-dev-select"/>, </phrase> insert your CD, reboot, and proceed to the next chapter.
da: Den nemmeste måde for de fleste er at bruge et sæt af &debian;-cd'er. Hvis du har et cd-sæt og din maskine understøtter opstart direkte fra cd'en så er det rigtig godt! Konfigurer dit system for <phrase arch="x86"> ved opstart fra en cd som beskrevet i <xref linkend="boot-dev-select"/>, </phrase> indsæt din cd, genstart og fortsæt til næste kapitel.

source: Note that certain CD drives may require special drivers, and thus be inaccessible in the early installation stages. If it turns out the standard way of booting off a CD doesn't work for your hardware, revisit this chapter and read about alternate kernels and installation methods which may work for you.
da: Bemærk at visse cd-drev kan kræve specielle drivere og kan derfor være utilgænglige i de første trin af installationen. Hvis det viser sig at den normale måde at starte op fra en cd ikke fungerer på dit udstyr, så besøg det her kapitel igen og læs om alternative kerner og installationsmetoder som måske vil fungere for dig.

source: Even if you cannot boot from CD-ROM, you can probably install the &debian; system components and any packages you want from CD-ROM. Simply boot using a different media, such as floppies. When it's time to install the operating system, base system, and any additional packages, point the installation system at the CD-ROM drive.
da: Selv om du ikke kan starte op fra cd-rom kan du antagelig installere &debian;s systemkomponenter og de pakker du ønsker fra cd-rom. Start helt enkelt op på et andet medie, såsom disketter. Når du når til installation af operativsystemet, grundsystemet og eventuelle ekstra pakker, så peg installationssystemet til cd-rom-drevet.

source: If you have problems booting, see <xref linkend="boot-troubleshooting"/>.
da: Hvis du har problemer med at starte op, så se <xref linkend="boot-troubleshooting"/>.

source: Booting from Firmware
da: Opstart fra firmware

source: There is an increasing number of consumer devices that directly boot from a flash chip on the device. The installer can be written to flash so it will automatically start when you reboot your machines.
da: Der er et stigende antal forbrugsenheder, som starter direkte op fra en flashchip på enheden. Installationsprogrammet kan skrives til flash så at den automatisk starter op når du genstarter dit udstyr.

source: In many cases, changing the firmware of an embedded device voids your warranty. Sometimes you are also not able to recover your device if there are problems during the flashing process. Therefore, please take care and follow the steps precisely.
da: I mange tilfælde medfører ændring af firmwaren i en indlejret enhed at din garanti forsvinder. Undertiden kan du heller ikke gendanne din enhed, hvis der opstår problemer under flashprocessen. Vær derfor forsigtig og følg trinene præcist.

source: Booting the SS4000-E
da: Opstart af SS4000-E

source: Due to limitations in the SS4000-E firmware, it unfortunately is not possible to boot the installer without the use of a serial port at this time. To boot the installer, you will need a serial nullmodem cable; a computer with a serial port<footnote id="arm-s4ke-port"> <para> A USB serial converter will also work. </para> </footnote>; and a ribbon cable with a male DB9 connector at one end, and a 10-pin .1" IDC header at the other<footnote id="arm-s4k-rib"> <para> This cable is often found in older desktop machines with builtin 9-pin serial ports. </para> </footnote>.
da: På grund af begrænsninger i firmwaren for SS4000-E så er det desværre i øjeblikket ikke muligt at starte installationsprogrammet op uden brug af en serielport. Fo at starte installationsprogrammet op, så skal du bruge et serielt nullmodem-kabel; en computer med en serielport<footnote id="arm-s4ke-port"> <para> Et USB-serielkonverteringsprogram kan også fungere. </para> </footnote>; og et kabel med en DB9-kontakt i den ene ende og en 10-pin .1" IDC-header i den andeb<footnote id="arm-s4k-rib"> <para> Dette kabel findes ofte i ældre stationære computere og indbyggede 9-pin serielporte. </para> </footnote>.

source: To boot the SS4000-E, use your serial nullmodem cable and the ribbon cable to connect to the serial port of the SS4000-E, and reboot the machine. You need to use a serial terminal application to communicate with the machine; a good option on a &debian; GNU/Linux is to use the <command>cu</command> program, in the package of the same name. Assuming the serial port on your computer is to be found on <filename>/dev/ttyS0</filename>, use the following command line:
da: For at starte op fra en SS4000-E så brug dit serielle nullmodem-kabel ribbon-kablet til at forbinde til den serielle port for SS4000-E og genstart din maskine. Du skal bruge et serielt terminalprogram til at kommunikere med maskinen; et godt valg på &debian; GNU/Linux er at bruge programmet <command>cu</command>, i pakken af samme navn. Hvis det antages at serielporten på din computer findes på <filename>/dev/ttyS0</filename> så brug følgende kommando:

source: If using Windows, you may want to consider using the program <classname>hyperterminal</classname>. Use a baud rate of 115200, 8 bits word length, no stop bits, and one parity bit.
da: Hvis du bruger Windows, så kan du overveje at bruge programmet <classname>hyperterminal</classname>. Brug en baudhastighed på 115200, 8-bit ordlængde, ingen stop-bit og en paritet-bit.

source: When the machine boots, you will see the following line of output:
da: Når maskinen starter op, så vil du se de følgende resultatlinjer:

source: At this point, hit Control-C to interrupt the boot loader<footnote id="arm-s4ke-sec"> <para> Note that you have only one second to do so; if you miss this window, just powercycle the machine and try again. </para> </footnote>. This will give you the RedBoot prompt. Enter the following commands:
da: På det her tidspunkt så tryk på Control-C for at afbryde opstartsindlæseren<footnote id="arm-s4ke-sec"> <para> Bemærk at du kun har et sekund til at gøre det i; hvis du misser dette vindue, start computeren op igen og prøv igen. </para> </footnote>. Dette fører dig til RedBoot-prompten. Indtast den følgende kommando:

source: After every <command>load</command> command, the system will expect a file to be transmitted using the YMODEM protocol. When using cu, make sure you have the package <classname>lrzsz</classname> installed, then hit enter, followed by the <quote>~&lt;</quote> escape sequence to start an external program, and run <command>sb initrd.gz</command> or <command>sb vmlinuz</command>.
da: Efter hver <command>load</command>-kommando vil systemet forvente at en fil sendes med YMODEM-protokollen. Når du bruger cu, så sikre dig at du har pakken <classname>lrzsz</classname> installeret, tryk retur, efterfulgt af <quote>~&lt;</quote>-undvigesekvensen for at starte et eksternt program og kør <command>sb initrd.gz</command> eller <command>sb vmlinuz</command>.

source: Alternatively, it is possible to load the kernel and ramdisk using HTTP rather than YMODEM. This is faster, but requires a working HTTP server on the network. To do so, first switch the bootloader to RAM mode:
da: Alternativt er det muligt at indlæse kernen og ramdisk med HTTP fremfor YMODEM. Dette er hurtigere, men kræver en fungerende HTTP-server på netværket. For at gøre dette så skift opstartsindlæseren til RAM-tilstand:

source: This will seemingly restart the machine; but in reality, it loads redboot to RAM and restarts it from there. Not doing this step will cause the system to hang in the necessary ip_address step that comes next.
da: Dette vil få det til at se ud som om, at du har genstartet maskinen; men i virkeligheden så genindlæser den redboot til RAM og genstarter derfra. Hvis dette trin ikke udføres vil systemet hænge i det nødvendige ip_address-trin som kommer derefter.

source: You will need to hit Ctrl-C again to interrupt the boot. Then: <informalexample><screen> ip_address -l <replaceable>192.168.2.249</replaceable> -h <replaceable>192.168.2.4</replaceable> load -v -r -b 0x01800000 -m http /initrd.gz load -v -r -b 0x01008000 -m http /zImage exec -c "console=ttyS0,115200 rw root=/dev/ram mem=256M@0xa0000000" -r 0x01800000 </screen></informalexample> Where <replaceable>192.168.2.249</replaceable> is the IP address of the installed system and <replaceable>192.168.2.4</replaceable> the IP address of the HTTP server containing the kernel and ramdisk files.
da: Du skal trykke på Ctrl-C igen for at afbryde opstarten. Derefter: <informalexample><screen> ip_address -l <replaceable>192.168.2.249</replaceable> -h <replaceable>192.168.2.4</replaceable> load -v -r -b 0x01800000 -m http /initrd.gz load -v -r -b 0x01008000 -m http /zImage exec -c "console=ttyS0,115200 rw root=/dev/ram mem=256M@0xa0000000" -r 0x01800000 </screen></informalexample> hvor <replaceable>192.168.2.249</replaceable> er IP-adressen for det installerede system og <replaceable>192.168.2.4</replaceable> IP-adressen for HTTP-serveren, der indeholder kernen og ramdisk-filerne.

source: The installer will now start as usual.
da: Installationsprogrammet vil nu starte som normalt.

source: Booting from a CD-ROM
da: Opstart fra en cd-rom

source: Booting from Windows
da: Opstart fra Windows

source: To start the installer from Windows, you can either
da: For at starte installationsprogrammet fra Windows kan du enten

source: download a standalone Windows executable, which is available as tools/win32-loader/stable/win32-loader.exe on the &debian; mirrors,
da: hente en uafhængig kørbar fil for Windows, som er tilgængelig som tools/win32-loader/stable/win32-loader.exe på &debian;-spejlene,

source: If you use an installation CD or DVD, a pre-installation program should be launched automatically when you insert the disc. In case Windows does not start it automatically, or if you are using a USB memory stick, you can run it manually by accessing the device and executing <command>setup.exe</command>.
da: Hvis du bruger en installations-cd eller -dvd, vil et præinstallationsprogram blive startet automatisk når du indsætter disken. I tilfælde af, at Windows ikke starter den automatisk, eller hvis du bruger et USB-drev, så kan du starte manuelt ved at tilgå enheden og køre <command>setup.exe</command>.

source: After the program has been started, a few preliminary questions will be asked and the system will be prepared to reboot into the &debian-gnu; installer.
da: Efter at programmet er blevet startet, vil nogle få forhåndsspørgsmål blive stillet og systemet vil blive forberedt til at genstarte ind i &debian-gnu;-installationsprogrammet.

source: Boot into DOS (not Windows). To do this, you can for instance boot from a recovery or diagnostic disk.
da: Start op i DOS (ikke Windows). For at gøre dette kan du for eksempel starte op fra en gendannelses- eller diagonostikdisk.

source: If you can access the installation CD, change the current drive to the CD-ROM drive, e.g. <informalexample><screen> d: </screen></informalexample> else make sure you have first prepared your hard disk as explained in <xref linkend="files-loadlin"/>, and change the current drive to it if needed.
da: Hvis du kan tilgå installations-cd'en, så ændr det aktuelle drev til cd-rom-drevet, f.eks. <informalexample><screen> d: </screen></informalexample> ellers skal du sikre dig, at du først har forberedt din harddisk som forklaret i<xref linkend="files-loadlin"/>, og ændre det aktuelle drev, hvis det er krævet.

source: Enter the subdirectory for the flavor you chose, e.g., <informalexample><screen> cd \&x86-install-dir; </screen></informalexample> If you prefer using the graphical installer, enter the <filename>gtk</filename> sub-directory. <informalexample><screen> cd gtk </screen></informalexample> Next, execute <command>install.bat</command>. The kernel will load and launch the installer system.
da: Gå til undermappen for den variant du ønsker, f.eks. <informalexample><screen> cd \&x86-install-dir; </screen></informalexample> Hvis du foretrækker det grafiske installationsprogram, så gå til undermappen <filename>gtk</filename>. <informalexample><screen> cd gtk </screen></informalexample> Kør derefter <command>install.bat</command>. Kernen vil indlæse og igangsætte installationssystemet.

source: To boot the installer from hard disk, you must first download and place the needed files as described in <xref linkend="boot-drive-files"/>.
da: For at starte installationsprogrammet op fra harddisken skal du først hente og placere de nødvendige filer som beskrevet i <xref linkend="boot-drive-files"/>.

source: If you intend to use the hard drive only for booting and then download everything over the network, you should download the <filename>netboot/debian-installer/&architecture;/initrd.gz</filename> file and its corresponding kernel <filename>netboot/debian-installer/&architecture;/linux</filename>. This will allow you to repartition the hard disk from which you boot the installer, although you should do so with care.
da: Hvis du har tænkt dig kun at bruge harddisken for opstart og så hente alt over netværket, så skal du hente filen <filename>netboot/debian-installer/&architecture;/initrd.gz</filename> og dens modsvarende kerne, <filename>netboot/debian-installer/&architecture;/linux</filename>. Dette vil give dig mulighed for at partitionere harddisken, du starter installationsprogrammet op fra, om selvom du bør gøre dette med forsigtighed.

source: Alternatively, if you intend to keep an existing partition on the hard drive unchanged during the install, you can download the <filename>hd-media/initrd.gz</filename> file and its kernel, as well as copy a CD (or DVD) iso to the drive (make sure the file is named ending in <literal>.iso</literal>). The installer can then boot from the drive and install from the CD/DVD image, without needing the network.
da: Alternativt, hvis du forventer at bevare en eksisterende partition på harddisken uændret under installationen, så kan du hente filen <filename>hd-media/initrd.gz</filename> og dens kerne, samt kopiere en cd-iso (eller dvd-iso) til drevet (sikr dig at filens navn ender med <literal>.iso</literal>). Installationsprogrammet kan så starte op fra drevet og installere fra cd/dvd-aftrykket, uden at kræve netværket.

source: For <command>LILO</command>, you will need to configure two essential things in <filename>/etc/lilo.conf</filename>: <itemizedlist> <listitem><para> to load the <filename>initrd.gz</filename> installer at boot time; </para></listitem> <listitem><para> have the <filename>vmlinuz</filename> kernel use a RAM disk as its root partition. </para></listitem> </itemizedlist> Here is a <filename>/etc/lilo.conf</filename> example:
da: For <command>LILO</command> skal du konfigurere to essentielle ting i <filename>/etc/lilo.conf</filename>: <itemizedlist> <listitem><para> for at indlæse installationsprogrammet <filename>initrd.gz</filename> ved opstartstidspunktet; </para></listitem> <listitem><para> lad <filename>vmlinuz</filename>-kernen bruge en RAM-disk som sin rodpartition. </para></listitem> </itemizedlist> Her er et <filename>/etc/lilo.conf</filename>-eksempel:

source: For more details, refer to the <citerefentry><refentrytitle>initrd</refentrytitle> <manvolnum>4</manvolnum></citerefentry> and <citerefentry><refentrytitle>lilo.conf</refentrytitle> <manvolnum>5</manvolnum></citerefentry> man pages. Now run <userinput>lilo</userinput> and reboot.
da: For yderligere detaljer, så se manualsiderne <citerefentry><refentrytitle>initrd</refentrytitle> <manvolnum>4</manvolnum></citerefentry> og <citerefentry><refentrytitle>lilo.conf</refentrytitle> <manvolnum>5</manvolnum></citerefentry>. Kør nu <userinput>lilo</userinput> og genstart.

source: The procedure for <command>GRUB1</command> is quite similar. Locate your <filename>menu.lst</filename> in the <filename>/boot/grub/</filename> directory (or sometimes <filename>/boot/boot/grub/</filename>) and add an entry for the installer, for example (assuming <filename>/boot</filename> is on the first partition of the first disk in the system):
da: Proceduren for <command>GRUB1</command> ligner meget. Find din <filename>menu.lst</filename> i mappen <filename>/boot/grub/</filename> (eller undertiden <filename>/boot/boot/grub/</filename>) og tilføj en post for installationsprogrammet, for eksempel (antager at <filename>/boot</filename> er på den første partition på den første disk i systemet):

source: The procedure for <command>GRUB2</command> is very similar. The file is named <filename>grub.cfg</filename> instead of <filename>menu.lst</filename>. An entry for the installer would be for instance for example:
da: Proceduren for <command>GRUB2</command> er meget lignende. Filen hedder <filename>grub.cfg</filename> i stedet for <filename>menu.lst</filename>. En post for installationsprogrammet ville for eksempel være:

source: From here on, there should be no difference between <command>GRUB</command> or <command>LILO</command>.
da: Herfra bør der ikke være forskel på <command>GRUB</command> eller <command>LILO</command>.

source: Booting from USB Memory Stick
da: Opstart fra USB-drev

source: Let's assume you have prepared everything from <xref linkend="boot-dev-select"/> and <xref linkend="boot-usb-files"/>. Now just plug your USB stick into some free USB connector and reboot the computer. The system should boot up, and unless you have used the flexible way to build the stick and not enabled it, you should be presented with the <prompt>boot:</prompt> prompt. Here you can enter optional boot arguments, or just hit &enterkey;.
da: Lad os antage, at du har forberedt alt fra <xref linkend="boot-dev-select"/> og <xref linkend="boot-usb-files"/>. Indsæt dit USB-drev i en ledig indgang og genstart computeren. Systemet bør starte op, og med mindre du har brugt den fleksible måde til at bygge drevet med og ikke aktiveret det, vil du blive præsenteret for prompten <prompt>boot:</prompt>. Her kan du indtaste valgfrie opstartsargumenter, eller bare trykke på &enterkey;.

source: Booting from Floppies
da: Opstart fra disketter

source: You will have already downloaded the floppy images you needed and created floppies from the images in <xref linkend="create-floppy"/>.
da: Du skal have hentet disketteaftrykkene og oprettet disketter ud fra aftrykkene i <xref linkend="create-floppy"/>.

source: To boot from the installer boot floppy, place it in the primary floppy drive, shut down the system as you normally would, then turn it back on.
da: For at starte op fra installationsdisketten, så placer den i det primære diskettedrev, luk systemet ned som normalt, og tænd det så igen.

source: For installing from an LS-120 drive (ATAPI version) with a set of floppies, you need to specify the virtual location for the floppy device. This is done with the <emphasis>root=</emphasis> boot argument, giving the device that the ide-floppy driver maps the device to. For example, if your LS-120 drive is connected as the first IDE device (master) on the second cable, you enter <userinput>install root=/dev/hdc</userinput> at the boot prompt.
da: For at installere fra et LS-120-drev (ATAPI-version) med et sæt disketter, så skal du angive den virtuelle placering for diskettedrevet. Dette gøres med opstartsargumentet <emphasis>root=</emphasis>, der skal have enheden som ide-floppy-enheden placerer enheden på. For eksempel, hvis dit LS-120-drev er forbundet som den første IDE-enhed (master) på det andet kabel, så indtaster du <userinput>install root=/dev/hdc</userinput> ved opstartsprompten.

source: Note that on some machines, <keycombo><keycap>Control</keycap> <keycap>Alt</keycap> <keycap>Delete</keycap></keycombo> does not properly reset the machine, so a <quote>hard</quote> reboot is recommended. If you are installing from an existing operating system (e.g., from a DOS box) you don't have a choice. Otherwise, please do a hard reboot when booting.
da: Bemærk at på nogle maskiner nulstiller <keycombo><keycap>Control</keycap> <keycap>Alt</keycap> <keycap>Delete</keycap></keycombo> ikke korrekt maskinen, så en <quote>hård</quote> genstart anbefales. Hvis du installerer fra et eksisterende operativsystem (f.eks. fra en DOS-boks) så har du ikke en valgmulighed. Ellers udfør en hård genstart ved opstart.

source: The floppy disk will be accessed, and you should then see a screen that introduces the boot floppy and ends with the <prompt>boot:</prompt> prompt.
da: Disketten vil blive tilgået, og du bør se en skærm som introducerer opstartsdisketten og slutter med prompten <prompt>boot:</prompt>.

source: Once you press &enterkey;, you should see the message <computeroutput>Loading...</computeroutput>, followed by <computeroutput>Uncompressing Linux...</computeroutput>, and then a screenfull or so of information about the hardware in your system. More information on this phase of the boot process can be found below in <xref linkend="kernel-msgs"/>.
da: Når du trykker &enterkey;, bør du se beskeden <computeroutput>Loading...</computeroutput>, efterfulgt af <computeroutput>Uncompressing Linux...</computeroutput>, og så cirka en skærmfuld af information om udstyret i dit system. Yderligere information om denne fase ved opstartsprocessen kan findes nedenfor i <xref linkend="kernel-msgs"/>.
