Repository: kaplanlior/debian-installer
Catalog: manual/po/*/boot-installer.po
Languages: da

source: If you set up BootX in <xref linkend="files-oldworld"/>, you can use it to boot into the installation system. Double click the <guiicon>BootX</guiicon> application icon. Click on the <guibutton>Options</guibutton> button and select <guilabel>Use Specified RAM Disk</guilabel>. This will give you the chance to select the <filename>ramdisk.image.gz</filename> file. You may need to select the <guilabel>No Video Driver</guilabel> checkbox, depending on your hardware. Then click the <guibutton>Linux</guibutton> button to shut down MacOS and launch the installer.
da: Hvis du opsætter BootX i <xref linkend="files-oldworld"/>, så kan du bruge den til at starte op i installationssystemet. Dobbeltklik på programikonet <guiicon>BootX</guiicon>. Klik på knappen <guibutton>Options</guibutton> og vælg <guilabel>Use Specified RAM Disk</guilabel>. Dette vil give dig mulighed for at vælge filen <filename>ramdisk.image.gz</filename>. Du skal måske vælge afkrydsningsboksen <guilabel>No Video Driver</guilabel>, afhængig af dit udstyr. Klik så på knappen <guibutton>Linux</guibutton> for at lukke MacOS ned og igangsæt installationsprogrammet.

source: Booting NewWorld Macs from OpenFirmware
da: Opstart af NewWorld Macs fra OpenFirmware

source: You will have already placed the <filename>vmlinux</filename>, <filename>initrd.gz</filename>, <filename>yaboot</filename>, and <filename>yaboot.conf</filename> files at the root level of your HFS partition in <xref linkend="files-newworld"/>. You will now have to boot into OpenFirmware (see <xref linkend="invoking-openfirmware"/>). At the prompt, type <informalexample><screen> 0 &gt; boot hd:<replaceable>x</replaceable>,yaboot </screen></informalexample> replacing <replaceable>x</replaceable> with the partition number of the HFS partition where the kernel and yaboot files were placed, followed by a &enterkey;. On some machines, you may need to use <userinput>ide0:</userinput> instead of <userinput>hd:</userinput>. In a few more seconds you will see a yaboot prompt <informalexample><screen> boot: </screen></informalexample> At yaboot's <prompt>boot:</prompt> prompt, type either <userinput>install</userinput> or <userinput>install video=ofonly</userinput> followed by a &enterkey;. The <userinput>video=ofonly</userinput> argument is for maximum compatibility; you can try it if <userinput>install</userinput> doesn't work. The &debian; installation program should start.
da: Du har allerede placeret filerne <filename>vmlinux</filename>, <filename>initrd.gz</filename>, <filename>yaboot</filename> og <filename>yaboot.conf</filename> på rodniveauet på din HFS-partition i <xref linkend="files-newworld"/>. Du skal nu starte op i OpenFirmware (se <xref linkend="invoking-openfirmware"/>). I prompten taster du <informalexample><screen> 0 &gt; boot hd:<replaceable>x</replaceable>,yaboot </screen></informalexample> hvor du erstatter <replaceable>x</replaceable> med partitionsnummret for HFS-partitionen, hvor kernen og yaboot-filerne blev placeret efterfulgt af &enterkey;. På nogle maskiner, skal du måske bruge <userinput>ide0:</userinput> i stedet for <userinput>hd:</userinput>. Efter nogle få yderligere sekunder vil du se en yaboot-prompt <informalexample><screen> boot: </screen></informalexample> Ved yaboots <prompt>boot:</prompt>-prompt, så tast enten <userinput>install</userinput> eller <userinput>install video=ofonly</userinput> efterfulgt af &enterkey;. Argumentet <userinput>video=ofonly</userinput> er for maksimal kompatibilitet; du kan prøve dette hvis <userinput>install</userinput> ikke fungerer. &debian;-installationsprogrammet bør starte.

source: Booting from USB memory stick
da: Opstart fra USB-hukommelsesdrev

source: Currently, NewWorld PowerMac systems are known to support USB booting.
da: Aktuelt kan NewWorld PowerMac-systemer understøtte USB-opstart.

source: Make sure you have prepared everything from <xref linkend="boot-usb-files"/>. To boot a Macintosh system from a USB stick, you will need to use the Open Firmware prompt, since Open Firmware does not search USB storage devices by default. See <xref linkend="invoking-openfirmware"/>.
da: Sikr dig at du har forberedt alt fra <xref linkend="boot-usb-files"/>. For at starte et Macintosh-system op fra et USB-drev, så skal du bruge Open Firmware-prompten, da Open Firmware ikke søger på USB-lagerenheder som standard. Se <xref linkend="invoking-openfirmware"/>.

source: You will need to work out where the USB storage device appears in the device tree, since at the moment <command>ofpath</command> cannot work that out automatically. Type <userinput>dev / ls</userinput> and <userinput>devalias</userinput> at the Open Firmware prompt to get a list of all known devices and device aliases. On the author's system with various types of USB stick, paths such as <filename>usb0/disk</filename>, <filename>usb0/hub/disk</filename>, <filename>/pci@f2000000/usb@1b,1/disk@1</filename>, and <filename>/pci@f2000000/usb@1b,1/hub@1/disk@1</filename> work.
da: Du skal undersøge hvor USB-lagerenheden fremgår af enhedstræet, da <command>ofpath</command> i øjeblikket ikke kan udregne dette automatisk. Tast <userinput>dev / ls</userinput> og <userinput>devalias</userinput> i Open Firmware-prompten for at få en liste over alle kendte enheder og enhedsaliasser. På forfatterens system med forskellige typer af USB-drev, ser stierne således ud <filename>usb0/disk</filename>, <filename>usb0/hub/disk</filename>, <filename>/pci@f2000000/usb@1b,1/disk@1</filename> og <filename>/pci@f2000000/usb@1b,1/hub@1/disk@1</filename>.

source: Having worked out the device path, use a command like this to boot the installer: <informalexample><screen> boot <replaceable>usb0/disk</replaceable>:<replaceable>2</replaceable>,\\:tbxi </screen></informalexample> The <replaceable>2</replaceable> matches the Apple_HFS or Apple_Bootstrap partition onto which you copied the boot image earlier, and the <userinput>,\\:tbxi</userinput> part instructs Open Firmware to boot from the file with an HFS file type of "tbxi" (i.e. <command>yaboot</command>) in the directory previously blessed with <command>hattrib -b</command>.
da: Med enhedsstien fundet, så brug en kommando som denne for at starte installationsprogrammet op: <informalexample><screen> boot <replaceable>usb0/disk</replaceable>:<replaceable>2</replaceable>,\\:tbxi </screen></informalexample> <replaceable>2</replaceable> matcher partitionen Apple_HFS eller Apple_Bootstrap hvortil du tidligere kopierede opstartsaftrykket og delen <userinput>,\\:tbxi</userinput> instruerer Open Firmware i at opstarte fra filen med en HFS-filtype »tbxi« (dvs. <command>yaboot</command>) i mappen tidligere velsignet med <command>hattrib -b</command>.

source: The system should now boot up, and you should be presented with the <prompt>boot:</prompt> prompt. Here you can enter optional boot arguments, or just hit &enterkey;.
da: Systemet skal nu starte op, og du bør blive præsenteret for prompten <prompt>boot:</prompt>. Her kan du indtaste valgfrie opstartsargumenter, eller bare trykke på &enterkey;.

source: This boot method is new, and may be difficult to get to work on some NewWorld systems. If you have problems, please file an installation report, as explained in <xref linkend="submit-bug"/>.
da: Opstartsmetoden er ny, og kan være svær at få til at fungere på nogle NewWorld-systemer. Hvis du har problemer, så indsend venligst en installationsrapport, som forklaret i <xref linkend="submit-bug"/>.

source: Currently, PReP and New World PowerMac systems support netbooting.
da: Aktuelt understøtter PReP- og New World PowerMac-systemer netopstart.

source: On machines with Open Firmware, such as NewWorld Power Macs, enter the boot monitor (see <xref linkend="invoking-openfirmware"/>) and use the command <informalexample><screen> 0 &gt; boot enet:0 </screen></informalexample> If this doesn't work, you might have to add the filename like this: <informalexample><screen> 0 &gt; boot enet:0,yaboot </screen></informalexample> PReP and CHRP boxes may have different ways of addressing the network. On a PReP machine, you should try <informalexample><screen> boot net:<replaceable>server_ipaddr</replaceable>,<replaceable>file</replaceable>,<replaceable>client_ipaddr</replaceable> </screen></informalexample> On some PReP systems (e.g. Motorola PowerStack machines) the command <userinput>help boot</userinput> may give a description of syntax and available options.
da: På maskiner med Open Firmware, såsom NewWorld Power Macs, går du i boot-monitoren (se <xref linkend="invoking-openfirmware"/>) og brug kommandoen <informalexample><screen> 0 &gt; boot enet:0 </screen></informalexample> Hvis dette ikke virker, så skal du måske tilføje filnavnet således: <informalexample><screen> 0 &gt; boot enet:0,yaboot </screen></informalexample> PReP- og CHRP-bokse kan have forskellige måder at adressere netværket på. På en PReP-maskine, kan du prøve <informalexample><screen> boot net:<replaceable>server_ipaddr</replaceable>,<replaceable>file</replaceable>,<replaceable>client_ipaddr</replaceable> </screen></informalexample> På nogle PReP-systemer (f.eks. Motorola PowerStack-maskiner) kan kommandoen <userinput>help boot</userinput> levere en beskrivelse af syntaks og tilgængelige indstillinger.

source: Booting from floppies is supported for &arch-title;, although it is generally only applicable for OldWorld systems. NewWorld systems are not equipped with floppy drives, and attached USB floppy drives are not supported for booting.
da: Opstart fra diskettedrev er understøttet for &arch-title;, selvom det generelt kun er gældende for OldWorld-systemer. NewWorld-systemer er ikke udstyret med diskettedrev, og tilsluttede USB-drev er ikke understøttet for opstart.

source: To boot from the <filename>boot-floppy-hfs.img</filename> floppy, place it in floppy drive after shutting the system down, and before pressing the power-on button.
da: For at starte op fra disketten <filename>boot-floppy-hfs.img</filename>, så placer den i diskettedrevet efter at systemet er lukket ned, og før du trykker på tændknappen.

source: For those not familiar with Macintosh floppy operations: a floppy placed in the machine prior to boot will be the first priority for the system to boot from. A floppy without a valid boot system will be ejected, and the machine will then check for bootable hard disk partitions.
da: For dem der ikke er bekendt med Macintosh-diskettedrevhandlinger: En diskette placeret i maskinen før opstart vil få første prioritet som opstart. En diskette uden et gyldigt opstartssystem vil blive skubbte ud, og maskinen vil så kigge efter harddiskpartitioner, der kan startes op fra.

source: After booting, the <filename>root.bin</filename> floppy is requested. Insert the root floppy and press &enterkey;. The installer program is automatically launched after the root system has been loaded into memory.
da: Efter opstart anmodes der om disketten <filename>root.bin</filename>. Indsæt roddisketten og tryk på &enterkey;. Installationsprogrammet startes automatisk efter at rodsystemet er blevet indlæst i hukommelsen.

source: PowerPC Boot Parameters
da: PowerPC-opstartsparametre

source: Many older Apple monitors used a 640x480 67Hz mode. If your video appears skewed on an older Apple monitor, try appending the boot argument <userinput>video=atyfb:vmode:6</userinput> , which will select that mode for most Mach64 and Rage video hardware. For Rage 128 hardware, this changes to <userinput>video=aty128fb:vmode:6</userinput> .
da: Mange ældre Appleskærme brugte en 640x480 67 Hz-tilstand. Hvis dit billede fremstår forskudt på en ældre Appleskærm, så prøv at tilføje opstartsparameteren <userinput>video=atyfb:vmode:6</userinput>, som vil vælge den tilstand for det meste Mach64- og Rage-videoudstyr. For Rage 128-udstyr bliver det <userinput>video=aty128fb:vmode:6</userinput> .

source: On machines with OpenBoot, simply enter the boot monitor on the machine which is being installed (see <xref linkend="invoking-openboot"/>). Use the command <userinput>boot net</userinput> to boot from a TFTP and RARP server, or try <userinput>boot net:bootp</userinput> or <userinput>boot net:dhcp</userinput> to boot from a TFTP and BOOTP or DHCP server. You can pass extra boot parameters to &d-i; at the end of the <userinput>boot</userinput> command.
da: På maskiner med OpenBoot, så indtast opstartsskærmen for maskinen som der installeres på (se <xref linkend="invoking-openboot"/>). brug kommandoen <userinput>boot net</userinput> til at starte op med fra en TFTP- og RARP-server, eller prøv <userinput>boot net:bootp</userinput> eller <userinput>boot net:dhcp</userinput> til at starte op fra en TFTP- og BOOTP- eller DHCP-server. Du kan sende ekstra opstartsparametre til &d-i; i slutningen af kommandoen <userinput>boot</userinput>.

source: Most OpenBoot versions support the <userinput>boot cdrom</userinput> command which is simply an alias to boot from the SCSI device on ID 6 (or the secondary master for IDE based systems).
da: De fleste OpenBoot-versioner understøtter kommandoen <userinput>boot cdrom</userinput>, hvilket kun er et alias for at starte fra SCSI-enheden på ID 6 (eller den sekundære master for IDE-baserede systemer).

source: IDPROM Messages
da: IDPROM-beskeder

source: If you cannot boot because you get messages about a problem with <quote>IDPROM</quote>, then it's possible that your NVRAM battery, which holds configuration information for you firmware, has run out. See the <ulink url="&url-sun-nvram-faq;">Sun NVRAM FAQ</ulink> for more information.
da: Hvis du ikke kan starte op fordi du får beskeder om et problem med <quote>IDPROM</quote>, så er det muligt at dit NVRAM-batteri, som indeholder konfigurationsinformation for din firmware er løbet tør. se <ulink url="&url-sun-nvram-faq;">Sun NVRAM OSS</ulink> for yderligere information.

source: Accessibility
da: Tilgængelighed

source: Some users may need specific support because of e.g. some visual impairment. <phrase arch="ia64;powerpc;x86">USB braille displays are detected automatically (not serial displays connected via a serial-to-USB converter), but most other</phrase> <phrase arch="arm;hppa;mips;mipsel;sparc">Most</phrase> accessibility features have to be enabled manually. <phrase arch="x86">On machines that support it, the boot menu emits a beep when it is ready to receive keystrokes.</phrase> Some boot parameters can <phrase arch="x86">then</phrase> be appended to enable accessibility features<phrase arch="x86"> (see also <xref linkend="boot-screen"/>)</phrase>. Note that on most architectures the boot loader interprets your keyboard as a QWERTY keyboard.
da: Nogle brugere kan have brug for specifik understøtelse, f.eks. på grund af en synshæmmelse. <phrase arch="ia64;powerpc;x86">USB-brailleskærme detekteres automatisk (ikke serielle skærme forbundet via en seriel-til-USB-konvertering), men de fleste andre</phrase> <phrase arch="arm;hppa;mips;mipsel;sparc"> De fleste</phrase> funktioner for tilgængelighed skal aktiveres manuelt. <phrase arch="x86">På maskiner som understøtter det, så afgiver opstartsmenuen en biplyd når den er klar til at modtage tastaturtryk.</phrase> Nogle opstartsparametre kan <phrase arch="x86">så</phrase> tilføjes for at aktivere tilgængelighedsfunktioner<phrase arch="x86"> (se også <xref linkend="boot-screen"/>)</phrase>. Bemærk at på de fleste arkitekturer fortolker opstartsindlæseren dit tastatur som et QERTY-tastatur.

source: USB Braille Displays
da: USB-brailleskærme

source: USB braille displays should be automatically detected. A textual version of the installer will then be automatically selected, and support for the braille display will be automatically installed on the target system. You can thus just press &enterkey; at the boot menu. Once <classname>brltty</classname> is started, you can choose a braille table by entering the preference menu. Documentation on key bindings for braille devices is available on the <ulink url="&url-brltty-driver-help;"><classname>brltty</classname> website</ulink>.
da: USB-brailleskærme bør detekteres automatisk. En tekstversion af installationsprogrammet vil så blive valgt automatisk og understøttelse for brailleskærmen vil automatisk blive installeret på målsystemet. Du kan så bare trykke på &enterkey; ved opstartsmenuen. Når <classname>brltty</classname> er startet, så kan du vælge en brailletabel ved at indtaste præferencemenuen. Dokumentation for genvejstaster til brailleenheder er tilgængelige på <ulink url="&url-brltty-driver-help;"><classname>brltty</classname> hjemmesiden</ulink>.

source: Serial Braille Displays
da: Serielle brailleskærme

source: Serial braille displays cannot safely be automatically detected (since that may damage some of them). You thus need to append the <userinput>brltty=<replaceable>driver</replaceable>,<replaceable>port</replaceable>,<replaceable>table</replaceable></userinput> boot parameter to tell <classname>brltty</classname> which driver it should use. <replaceable>driver</replaceable> should be replaced by the two-letter driver code for your terminal (see the <ulink url="&url-brltty-manual;">BRLTTY manual</ulink>). <replaceable>port</replaceable> should be replaced by the name of the serial port the display is connected to, <userinput>ttyS0</userinput> is the default, <userinput>ttyUSB0</userinput> can be typically used when using a serial-to-USB converter. <replaceable>table</replaceable> is the name of the braille table to be used (see the <ulink url="&url-brltty-manual;">BRLTTY manual</ulink>); the English table is the default. Note that the table can be changed later by entering the preference menu. Documentation on key bindings for braille devices is available on the <ulink url="&url-brltty-driver-help;"><classname>brltty</classname> website</ulink>.
da: Serielle brailleskærme kan ikke detekteres på en sikker måde automatisk (da det kan ødelægge nogle af dem). Du skal derfor tilføje opstartsparameteren <userinput>brltty=<replaceable>driver</replaceable>,<replaceable>port</replaceable>,<replaceable>table</replaceable></userinput> for at fortælle <classname>brltty</classname> hvilken driver den skal bruge. <replaceable>driver</replaceable> skal erstattes af driverkoden i to bogstaver for din terminal (se <ulink url="&url-brltty-manual;">BRLTTY-manualen</ulink>). <replaceable>port</replaceable> skal erstattes af navnet for den serielle port skærmen er forbundet til, <userinput>ttyS0</userinput> er standarden, <userinput>ttyUSB0</userinput> kan typisk bruges når der bruges et seriel-til-USB-konverteringsprogram. <replaceable>table</replaceable> er navnet for brailletabellen, der skal bruges (se <ulink url="&url-brltty-manual;">BRLTTY-manualen</ulink>); den engelske tabel er standarden. Bemærk at tabellen kan ændres senere ved at indtaste præferencemenuen. Dokumentation vedrørende genvejstaster for brailleenheder er tilgængelig på <ulink url="&url-brltty-driver-help;"><classname>brltty</classname> hjemmesiden</ulink>.

source: Software Speech Synthesis
da: Understøttelse af talesyntese via programmer

source: Hardware Speech Synthesis
da: Understøttelse af talesyntese via udstyr

source: Hardware speech synthesis devices cannot be automatically detected. You thus need to append the <userinput>speakup.synth=<replaceable>driver</replaceable></userinput> boot parameter to tell <classname>speakup</classname> which driver it should use. <replaceable>driver</replaceable> should be replaced by the driver code for your device (see <ulink url="&url-speakup-guide;">driver code list</ulink>). The textual version of the installer will then be automatically selected, and support for the speech synthesis device will be automatically installed on the target system.
da: Enheder for udstyrstalesyntese kan ikke automatisk detekteres. Du skal derfor tilføje opstartsparameteren <userinput>speakup.synth=<replaceable>driver</replaceable></userinput> for at fortælle <classname>speakup</classname> hvilken driver den skal bruge. <replaceable>driver</replaceable> skal erstattes af driverkoden for din enhed (se <ulink url="&url-speakup-guide;">driverkodelisten</ulink>). Den tekstmæssige udgave af installationsprogramemt vil så automatisk blive valgt, og understøttelse for talesynteseenheden vil automatisk blive installeret på målsystemet.

source: Board Devices
da: Bundkortenheder

source: Some accessibility devices are actual boards that are plugged inside the machine and that read text directly from the video memory. To get them to work framebuffer support must be disabled by using the <userinput arch="x86">vga=normal</userinput> <userinput>fb=false</userinput> boot parameter. This will however reduce the number of available languages.
da: Nogle tilgængelighedsenheder er fysiske bundkort som er indsat i selve maskinen og som læser tekst direkte fra videohukommelsen. For at få dem til at virke skal understøttelse af framebuffer være deaktiveret ved at bruge opstartsparameteren <userinput arch="x86">vga=normal</userinput> <userinput>fb=false</userinput>. Dette vil dog reducere antallet af tilgængelige sprog.

source: If desired a textual version of the bootloader can be activated before adding the boot parameter by typing <userinput>h</userinput> &enterkey;.
da: Hvis det ønskes kan en tekstversion af opstartsindlæseren aktiveres før tilføjelse af opstartsparameteren ved at indtaste <userinput>h</userinput> &enterkey;.

source: High-Contrast Theme
da: Tema med høj kontrast

source: For users with low vision, the installer can use a high-contrast theme that makes it more readable. To enable it, append the <userinput>theme=dark</userinput> boot parameter.
da: For brugere med nedsat syn, kan installationsprogrammet bruge et tema med høj kontrast, hvilket gør det nemmere at læse. For at atkivere tilføjes <userinput>theme=dark</userinput> til opstartsparameteren.

source: Preseeding
da: Forhåndsindstilling

source: Alternatively, &debian; can be installed completely automatically by using preseeding. This is documented in <xref linkend="appendix-preseed"/>.
da: Alternativt kan &debian; installeres fuldstændig automatisk med brugen af forhåndsindstillinger. Dette er dokumenteret i <xref linkend="appendix-preseed"/>.

source: Boot parameters are Linux kernel parameters which are generally used to make sure that peripherals are dealt with properly. For the most part, the kernel can auto-detect information about your peripherals. However, in some cases you'll have to help the kernel a bit.
da: Opstartsparametre er parametre for Linuxkernen, som generelt bruges til at sikre at perifære enheder håndteres korrekt. I de fleste tilfælde kan kernen automatisk detektere information om dine perifære enheder. Dog skal du i nogle tilfælde hjælpe kernen lidt.

source: If this is the first time you're booting the system, try the default boot parameters (i.e., don't try setting parameters) and see if it works correctly. It probably will. If not, you can reboot later and look for any special parameters that inform the system about your hardware.
da: Hvis dette er den første gang du starter systemet op, så prøv standardparametrene for opstart (dvs. prøv uden at angive parametre) og se om det virker korrekt. Det vil det sikkert. Hvis ikke så kan du genstarte senere og kigge efter eventuelle specielle parametre som informerer dit system om dit udstyr.
