Repository: kaplanlior/debian-installer
Catalog: manual/po/*/boot-installer.po
Languages: da

source: Enter <command>elilo</command> and press <command>ENTER</command>. This will start the boot load sequence.
da: Indtast <command>elilo</command> og tryk <command>RETUR</command>. Dette vil igangsætte opstartssekvensen.

source: As with option 1, these steps start the &debian; boot loader which will display a menu page for you to select a boot kernel and options. You can also enter the shorter <command>fs<replaceable>n</replaceable>:elilo</command> command at the shell prompt. Proceed to selecting the boot kernel and options.
da: Som ved indstilling 1, igangsætter disse trin &debian;-opstartsindlæseren, som vil vise en menuside, hvor du kan vælge en opstartskerne og indstillinger. Du kan også indtaste den kortere kommando <command>fs<replaceable>n</replaceable>:elilo</command> på skalprompten. Fortsæt for at vælge opstartskernen og indstillinger.

source: Installing using a Serial Console
da: Installation med en seriel konsol

source: You may choose to perform an install using a monitor and keyboard or using a serial connection. To use a monitor/keyboard setup, select an option containing the string [VGA console]. To install over a serial connection, choose an option containing the string [<replaceable>BAUD</replaceable> baud serial console], where <replaceable>BAUD</replaceable> is the speed of your serial console. Menu items for the most typical baud rate settings on the ttyS0 device are preconfigured.
da: Du kan vælge at udføre en installation med en skærm og tastatur eller med brug af en seriel forbindelse. For at bruge en opsætning for skærm/tastatur, så vælg en indstilling, der indeholder strengen [VGA console]. For at installere over en seriel forbindelse, så vælg en instilling der indeholder strengen [<replaceable>BAUD</replaceable> baud serial console], hvor <replaceable>BAUD</replaceable> er hastigheden for din serielle konsol. Menupunkter for de typiske indstillinger for baudhastigheder på ttyS0-enheden er prækonfigurerede.

source: In most circumstances, you will want the installer to use the same baud rate as your connection to the EFI console. If you aren't sure what this setting is, you can obtain it using the command <command>baud</command> at the EFI shell.
da: I de fleste tilfælde vil du ønske at installationsprogrammet skal bruge den samme baudhastighed som din forbindelse til EFI-konsollen. Hvis du ikke er sikker på hvad denne indstilling er sat til, så kan du indhente denne oplysning med kommandoen <command>baud</command> via EFI-skallen.

source: If there is not an option available that is configured for the serial device or baud rate you would like to use, you may override the console setting for one of the existing menu options. For example, to use a 57600 baud console over the ttyS1 device, enter <command>console=ttyS1,57600n8</command> into the <classname>Boot:</classname> text window.
da: Hvis der ikke er en indstilling tilgængelig, som er konfigureret for den serielle enhed eller baudhastighed, du ønsker at bruge, så kan du overskrive konsolindstillingen for en af de eksisterende menuindstillinger. For eksempel: For at bruge 57600 baud-konsol over ttyS1-enheden så indtast <command>console=ttyS1,57600n8</command> i tekstvinduet <classname>Boot:</classname>.

source: Most IA-64 boxes ship with a default console setting of 9600 baud. This setting is rather slow, and the normal installation process will take a significant time to draw each screen. You should consider either increasing the baud rate used for performing the installation, or performing a Text Mode installation. See the <classname>Params</classname> help menu for instructions on starting the installer in Text Mode.
da: De fleste IA-64-bokse leveres med en standardindstilling for konsollen på 9600 baud. Denne indstilling er ret langsom, og den normale installationsproces vil bruge lang tid på at tegne hver skærm. Du bør overveje enten at øge baudhastigheden brugt for udførelse af installationen eller udføre en installation i teksttilstand. Se hjælpemenuen <classname>Params</classname> for instruktioner på opstart af installationsprogrammet i teksttilstand.

source: If you select the wrong console type, you will be able to select the kernel and enter parameters but both the display and your input will go dead as soon as the kernel starts, requiring you to reboot before you can begin the installation.
da: Hvis du vælger den forkerte konsoltype, vil du kunne vælge kernen og indtaste parametre, men både skærmen og dine indtastninger vil gå tabt så snart at kernen starter, hvilket kræver at du genstarter, før du kan begynde installationen.

source: Selecting the Boot Kernel and Options
da: Valg af opstartskernen og indstillinger

source: The boot loader will display a form with a menu list and a text window with a <classname>Boot:</classname> prompt. The arrow keys select an item from the menu and any text typed at the keyboard will appear in the text window. There are also help screens which can be displayed by pressing the appropriate function key. The <classname>General</classname> help screen explains the menu choices and the <classname>Params</classname> screen explains the common command line options.
da: Opstartsindlæseren vil vise en formular med en menuliste og et tekstvindue med en <classname>Boot:</classname>-prompt. Piletasterne vælger et punkt fra menuen og eventuel tekst indtastet på tastaturet vil blive vist i tekstvinduet. Der er også hjælpevinduer, som kan vises ved at trykke på den passende funktionstast. Hjælpevinduet <classname>General</classname> forklarer menuvalgene og vinduet <classname>Params</classname> forklarer de gængse indstillinger for kommandolinjen.

source: Consult the <classname>General</classname> help screen for the description of the kernels and install modes most appropriate for your installation. You should also consult <xref linkend="boot-parms"/> below for any additional parameters that you may want to set in the <classname>Boot:</classname> text window. The kernel version you choose selects the kernel version that will be used for both the installation process and the installed system. If you encounter kernel problems with the installation, you may also have those same problems with the system you install. The following two steps will select and start the install:
da: Se hjælpevinduet <classname>General</classname> for beskrivelse af kernerne og installationstilstandene som bedst passer for din installation. Du bør også konsultere <xref linkend="boot-parms"/> nedenfor for yderligere parametre, du ønsker at angive i tekstvinduet <classname>Boot:</classname>. Kerneversionen du vælger udvælger kerneversionen som vil blive brugt både for installationsprocessen og det installerede system. Hvis du møder kerneproblemer med installationen, kan du også have de samme problemer med systemet du installerer. De følgende to trin vil vælge og starte installationen:

source: Select the kernel version and installation mode most appropriate to your needs with the arrow keys.
da: Vælg kerneversion og installationstilstand der bedst passer til dine behov med piletasterne.

source: Enter any boot parameters by typing at the keyboard. The text will be displayed directly in the text window. This is where kernel parameters (such as serial console settings) are specified.
da: Indtast eventuelle opstartsparametre med tastaturet. Teksten vil blive vist direkte i tekstvinduet. Det er her at kerneparametre (såsom indstillinger for seriel konsol) specificeres.

source: Press <command>ENTER</command>. This will load and start the kernel. The kernel will display its usual initialization messages followed by the first screen of the &debian; Installer.
da: Tryk <command>RETUR</command>. Dette vil indlæse og starte kernen. Kernen vil vise dets normale initialiseringsbeskeder efterfulgt af den første skærm for &debian;-installationsprogrammet.

source: Proceed to the next chapter to continue the installation where you will set up the language locale, network, and disk partitions.
da: Fortsæt til det næste kapitel for at fortsætte installationen hvor du vil opsætte sprogområdet, netværk og diskpartitioner.

source: Booting an IA-64 system from the network is similar to a CD boot. The only difference is how the installation kernel is loaded. The EFI Boot Manager can load and start programs from a server on the network. Once the installation kernel is loaded and starts, the system install will proceed through the same steps as the CD install with the exception that the packages of the base install will be loaded from the network rather than the CD drive.
da: Opstart af et IA-64-system fra netværket ligner en cd-opstart. Den eneste forskel er hvordan installationskernen indlæses. EFI-opstartshåndteringen kan indlæse og starte programmer fra en server på netværket. Når først installationskernen er indlæst og starter, vil systeminstallationen fortsætte igennem de samme trin som cd-installationen med den undtagelse at pakkerne for grundinstallationen vil blive indlæst fra netværket fremfor fra cd-drevet.

source: Network booting an IA-64 system requires two architecture-specific actions. On the boot server, DHCP and TFTP must be configured to deliver <command>elilo</command>. On the client a new boot option must be defined in the EFI boot manager to enable loading over a network.
da: Netværksopstart af et IA-64-system kræver to arkitekturspecifikke handlinger. På opstartsserveren skal DHCP og TFTP være konfigureret til at levere <command>elilo</command>. På klienten skal en ny opstartsindstilling være defineret i EFI-opstartshåndteringen for at aktivere indlæsning over et netværk.

source: Configuring the Server
da: Konfiguration af serveren

source: A suitable TFTP entry for network booting an IA-64 system looks something like this: <informalexample><screen> host mcmuffin { hardware ethernet 00:30:6e:1e:0e:83; fixed-address 10.0.0.21; filename "debian-installer/ia64/elilo.efi"; } </screen></informalexample> Note that the goal is to get <command>elilo.efi</command> running on the client.
da: Et egnet TFTP-punkt for netværksopstart af et IA-64-system kan se således ud: <informalexample><screen> host mcmuffin { hardware ethernet 00:30:6e:1e:0e:83; fixed-address 10.0.0.21; filename "debian-installer/ia64/elilo.efi"; } </screen></informalexample> Bemærk at formålet er at få <command>elilo.efi</command> til at køre på klienten.

source: Extract the <filename>netboot.tar.gz</filename> file into the directory used as the root for your tftp server. Typical tftp root directories include <filename>/var/lib/tftp</filename> and <filename>/tftpboot</filename>. This will create a <filename>debian-installer</filename> directory tree containing the boot files for an IA-64 system.
da: Udtræk filen <filename>netboot.tar.gz</filename> til mappen brugt som root for din tftp-server. Typiske tftp-rootmapper inkluderer <filename>/var/lib/tftp</filename> og <filename>/tftpboot</filename>. Dette vil oprettet et mappetræ for <filename>debian-installer</filename>, der indeholder opstartsfilerne for et IA-64-system.

source: The <filename>netboot.tar.gz</filename> contains an <filename>elilo.conf</filename> file that should work for most configurations. However, should you need to make changes to this file, you can find it in the <filename>debian-installer/ia64/</filename> directory. It is possible to have different config files for different clients by naming them using the client's IP address in hex with the suffix <filename>.conf</filename> instead of <filename>elilo.conf</filename>. See documentation provided in the <classname>elilo</classname> package for details.
da: <filename>netboot.tar.gz</filename> indeholder en fil <filename>elilo.conf</filename> som bør virke med de fleste konfigurationer. Har du brug for ændringer i denne fil, så kan du finde den i mappen <filename>debian-installer/ia64/</filename>. Det er muligt at have forskellige konfigurationsfiler for forskellige klienter ved at navngive dem med klientens IP-adresse i hex med filendelsen <filename>.conf</filename> i stedet for <filename>elilo.conf</filename>. Se dokumentationen tilbudt i pakken <classname>elilo</classname> for detaljer.

source: Configuring the Client
da: Konfiguration af klienten

source: To configure the client to support TFTP booting, start by booting to EFI and entering the <guimenu>Boot Option Maintenance Menu</guimenu>. <itemizedlist> <listitem><para> Add a boot option. </para></listitem> <listitem><para> You should see one or more lines with the text <guimenuitem>Load File [Acpi()/.../Mac()]</guimenuitem>. If more than one of these entries exist, choose the one containing the MAC address of the interface from which you'll be booting. Use the arrow keys to highlight your choice, then press enter. </para></listitem> <listitem><para> Name the entry <userinput>Netboot</userinput> or something similar, save, and exit back to the boot options menu. </para></listitem> </itemizedlist> You should see the new boot option you just created, and selecting it should initiate a DHCP query, leading to a TFTP load of <filename>elilo.efi</filename> from the server.
da: For at konfigurere klienten til at understøtte TFTP-opstart, så begynd med at starte op i EFI og gå ind i <guimenu>Boot Option Maintenance Menu</guimenu>. <itemizedlist> <listitem><para> Add a boot option. </para></listitem> <listitem><para> Du bør se en eller flere linjer med teksten <guimenuitem>Load File [Acpi()/.../Mac()]</guimenuitem>. Hvis mere end en af disse punkter findes, så vælg den der indeholder MAC-adressen for grænsefladen hvorfra du starter op. Brug piletasterne til at fremhæve dit valg, tryk retur. </para></listitem> <listitem><para> Name the entry <userinput>Netboot</userinput> eller noget lignende, gem og afslut tilbage til menuen for opstartsindstillingerne. </para></listitem> </itemizedlist> Du bør se den nye opstartsindstilling du netop har oprettet, og valg af den bør initiere en DHCP-forespørgsel, der fører til en TFTP-indlæsning af <filename>elilo.efi</filename> fra serveren.

source: The boot loader will display its prompt after it has downloaded and processed its configuration file. At this point, the installation proceeds with the same steps as a CD install. Select a boot option as in above and when the kernel has completed installing itself from the network, it will start the &debian; Installer.
da: Opstartsindlæseren vil vise sin prompt efter at den har hentet og behandlet dens konfigurationsfil. På dette tidspunkt fortsætter installationen med de samme trin som ved en cd-installation. Vælg en opstartsindstilling som i ovenstående og når kernen har færddiggjort installation af sig selv fra netværket, vil den starte &debian;-installationsprogrammet.

source: SGI TFTP Booting
da: SGI TFTP-opstart

source: After entering the command monitor use <informalexample><screen> bootp(): </screen></informalexample> on SGI machines to boot linux and to begin installation of the &debian; Software. In order to make this work you may have to unset the <envar>netaddr</envar> environment variable. Type <informalexample><screen> unsetenv netaddr </screen></informalexample> in the command monitor to do this.
da: Efter indtastning så bruger kommandoovervågningen <informalexample><screen> bootp(): </screen></informalexample> på SGI-maskiner til at starte Linux op og til at begynde installationen af &debian;-programmet. For at dette skal virke, så skal du måske ændre indstilling på miljøvariablen <envar>netaddr</envar>. Tast <informalexample><screen> unsetenv netaddr </screen></informalexample> i kommandoovervågningen for dette.

source: Boot Parameters
da: Opstartsparametre

source: On SGI machines you can append boot parameters to the <command>bootp():</command> command in the command monitor.
da: På SGI-maskiner kan du tilføje opstartsparametre til kommandoen <command>bootp():</command> i kommandoskærmen.

source: Following the <command>bootp():</command> command you can give the path and name of the file to boot if you did not give an explicit name via your bootp/dhcp server. Example: <informalexample><screen> bootp():/boot/tftpboot.img </screen></informalexample> Further kernel parameters can be passed via <command>append</command>:
da: Efter kommandoen <command>bootp():</command> kan du angive stien og navnet på filen der skal igangsættes, hvis du ikke angav et eksplicit navn via din bootp/dhcp-server. Eksempel: <informalexample><screen> bootp():/boot/tftpboot.img </screen></informalexample> Yderligere kerneparametre kan sendes via <command>append</command>:

source: Cobalt TFTP Booting
da: Cobalt TFTP-opstart

source: Strictly speaking, Cobalt does not use TFTP but NFS to boot. You need to install an NFS server and put the installer files in <filename>/nfsroot</filename>. When you boot your Cobalt, you have to press the left and the right cursor buttons at the same time and the machine will boot via the network from NFS. It will then display several options on the display. There are the following two installation methods:
da: Rent faktisk så bruger Cobalt ikke TFTP men NFS til at igangsætte. Du skal installere en NFS-server og placere installationsfilerne i <filename>/nfsroot</filename>. Når du igangsætter din Cobalt, så skal du trykke på venstre og højre musetast på samme tid og maskinen vil så starte via netværket fra NFS. Den vil så vise flere indstillinger på skærmen. Der er de følgende to installationsmetoder:

source: Via SSH (default): In this case, the installer will configure the network via DHCP and start an SSH server. It will then display a random password and other login information (such as the IP address) on the Cobalt LCD. When you connect to the machine with an SSH client you can start with the installation.
da: Via SSH (standard): I dette tilfælde, vil installationsprogrammet konfigurere netværket via DHCP og starte en SSH-server. Den vil så vise en vilkårlig adgangskode og andre informationer for logind (såsom IP-adressen) på Cobalt LCD. Når du forbinder til maskinen med en SSH-klient, så kan du påbegynde installationen.

source: Via serial console: Using a null modem cable, you can connect to the serial port of your Cobalt machine (using 115200 bps) and perform the installation this way.
da: Via seriel konsol: Med brug af et nullmodemkabel, så kan du forbinde til den serielle port på din Cobaltmaskine (med brug af 115200 bps) og udføre installationen på denne måde.

source: You cannot pass any boot parameters directly. Instead, you have to edit the <filename>/nfsroot/default.colo</filename> file on the NFS server and add your parameters to the <replaceable>args</replaceable> variable.
da: Du kan ikke sende eventuelle parametre direkte. I stedet for skal du redigere filen <filename>/nfsroot/default.colo</filename> på NFS-serveren og tilføje dine parametre til variablen <replaceable>args</replaceable>.

source: s390 Limitations
da: s390-begrænsninger

source: In order to run the installation system a working network setup and ssh session is needed on S/390.
da: For at køre installationssystemet er en fungerende netværksopsætning og ssh-session krævet på S/390.

source: The booting process starts with a network setup that prompts you for several network parameters. If the setup is successful, you will login to the system by starting an ssh session which will launch the standard installation system.
da: Opstartsprocessen starter med en netværksopsætning, som anmoder dig om flere netværksparametre. Hvis opsætningen er succesfuld, vil du logge ind på systemet ved at starte en ssh-session, som vil igangsætte standardinstallationssystemet.

source: s390 Boot Parameters
da: s390-opstartsparametre

source: Currently, the only &arch-title; subarchitectures that support CD-ROM booting are PReP/CHRP (though not all systems) and New World PowerMacs. On PowerMacs, hold the <keycap>c</keycap> key, or else the combination of <keycap>Command</keycap>, <keycap>Option</keycap>, <keycap>Shift</keycap>, and <keycap>Delete</keycap> keys together while booting to boot from the factory default CD/DVD drive.
da: Aktuelt er de eneste &arch-title;-underarkitekturer, som understøtter cd-rom-opstart, PReP/CHRP (dog ikke alle systemer) og New World PowerMacs. På PowerMacs, hold tasten <keycap>c</keycap>, eller kombinationen af <keycap>Command</keycap>, <keycap>Option</keycap>, <keycap>Skift</keycap>, og <keycap>slet</keycap> nede samtidig under opstarten for at starte op fra fabriksstandardens cd/dvd-drev.

source: To boot a PowerMac from an external Firewire CD/DVD drive invoke Open Firmware prompt first (see <xref linkend="invoking-openfirmware"/>), then type <informalexample><screen> 0 &gt; boot fw/node/sbp-2/disk:,\install\yaboot </screen></informalexample> for an alternative way to boot from the internal factory default CD/DVD drive type
da: For at starte fra en PowerMac fra et eksternt Firewire cd/dvd-drev så igangsæt først Open Firmware-prompten (se <xref linkend="invoking-openfirmware"/>), tast så <informalexample><screen> 0 &gt; boot fw/node/sbp-2/disk:,\install\yaboot </screen></informalexample> for en alternativ måde at starte op på fra den interne fabriksstandards cd/dvd-drevtype

source: OldWorld PowerMacs will not boot a &debian; CD, because OldWorld computers relied on a Mac OS ROM CD boot driver to be present on the CD, and a free-software version of this driver is not available. All OldWorld systems have floppy drives, so use the floppy drive to launch the installer, and then point the installer to the CD for the needed files.
da: OldWorld PowerMacs vil ikke starte op med en &debian;-cd, da OldWorld-computere afhang af at en Mac OS ROM CD-opstartsdriver var til stede på cd'en, og en fri programversion af denne driver er ikke tilgængelig. Alle OldWorld-systemer har diskettedrev, så brug diskettedrevet til at igangsætte installationsprogrammet, og peg så installationsprogrammet til cd'en for de krævede filer.

source: To boot &debian; CD/DVD on Pegasos II machine, hold <keycap>Esc</keycap> key immediately after pressing the power-on button, when SmartFirmware prompt appears, type
da: For at starte &debian;-cd eller -dvd på Pegasos II-maskiner, så hold tasten <keycap>Esc</keycap> nede umiddelbart efter at du har trykket på tændknappen, når SmartFirmware-prompten fremkommer, så tast

source: Booting from Hard Disk
da: Opstart fra harddisk

source: Booting from an existing operating system is often a convenient option; for some systems it is the only supported method of installation.
da: Opstart fra et eksisterende operativsystem er ofte en nem mulighed; for nogle systemer er det den eneste understøttede installationsmetode.

source: To boot the installer from hard disk, you will have already completed downloading and placing the needed files as described in <xref linkend="boot-drive-files"/>.
da: For at starte installationsprogrammet op fra harddisken, så skal du allerede have hentet og placeret de krævede filer som beskrevet i <xref linkend="boot-drive-files"/>.

source: Booting OldWorld PowerMacs from MacOS
da: Opstart af OldWorld PowerMacs fra MacOS
