Repository: kaplanlior/debian-installer
Catalog: manual/po/*/boot-installer.po
Languages: da

source: Information on many boot parameters can be found in the <ulink url="http://www.tldp.org/HOWTO/BootPrompt-HOWTO.html"> Linux BootPrompt HOWTO</ulink>, including tips for obscure hardware. This section contains only a sketch of the most salient parameters. Some common gotchas are included below in <xref linkend="boot-troubleshooting"/>.
da: Information om mange opstartsparametre kan findes i <ulink url="http://www.tldp.org/HOWTO/BootPrompt-HOWTO.html"> Linux BootPrompt HOWTO</ulink>, inklusive fif for sjældent udstyr. Dette afsnit indeholder kun en skitse med de mest indlysende parametre. Nogle gængse problemstillinger er inkluderet nedenfor i <xref linkend="boot-troubleshooting"/>.

source: If you are booting with a serial console, generally the kernel will autodetect this. If you have a videocard (framebuffer) and a keyboard also attached to the computer which you wish to boot via serial console, you may have to pass the <userinput>console=<replaceable>device</replaceable></userinput> argument to the kernel, where <replaceable>device</replaceable> is your serial device, which is usually something like <filename>ttyS0</filename>.
da: Hvis du starter op med en seriel konsol, vil kernen generelt detektere dette automatisk. Hvis du har et videokort (framebuffer) og et tastatur der også er tilsluttet computeren, som du ønsker at starte op via seriel konsol, så skal du måske sende argumentet <userinput>console=<replaceable>device</replaceable></userinput> til kernen, hvor <replaceable>device</replaceable> er din seriel enhed, hvilket normalt ligner noget ala <filename>ttyS0</filename>.

source: In order to ensure the terminal type used by the installer matches your terminal emulator, the parameter <userinput>TERM=<replaceable>type</replaceable></userinput> can be added. Note that the installer only supports the following terminal types: <literal>linux</literal>, <literal>bterm</literal>, <literal>ansi</literal>, <literal>vt102</literal> and <literal>dumb</literal>. The default for serial console in &d-i; is <userinput>vt102</userinput>. If you are using a virtualization tool which does not provide conversion into such terminals types itself, e.g. QEMU/KVM, you can start it inside a <command>screen</command> session. That will indeed perform translation into the <literal>screen</literal> terminal type, which is very close to <literal>vt102</literal>.
da: For at sikre at terminaltypen brugt af installationsprogrammet matcher din terminalemulator kan parameteren <userinput>TERM=<replaceable>type</replaceable></userinput> tilføjes. Bemærk at installationsprogrammet kun understøtter de følgende terminaltyper: <literal>linux</literal>, <literal>bterm</literal>, <literal>ansi</literal>, <literal>vt102</literal> og <literal>dumb</literal>. Standarden for seriel konsol i &d-i; er <userinput>vt102</userinput>. Hvis du bruger et virtualiseringsværktøj, som ikke selv tilbyder konvertering til sådanne terminaltyper, f.eks. QEMU/KVM, så kan du starte den inden i en <command>screen</command>-session. Den vil udføre oversættelse til <literal>screen</literal>-terminaltypen, som er meget tæt på <literal>vt102</literal>.

source: For &arch-title; the serial devices are <filename>ttya</filename> or <filename>ttyb</filename>. Alternatively, set the <envar>input-device</envar> and <envar>output-device</envar> OpenPROM variables to <filename>ttya</filename>.
da: For &arch-title; er serielenhederne <filename>ttya</filename> eller <filename>ttyb</filename>. Alternativt sættes OpenPROM-variablerne <envar>input-device</envar> og <envar>output-device</envar> til <filename>ttya</filename>.

source: &debian; Installer Parameters
da: Parametre for &debian;-installationsprogrammet

source: The installation system recognizes a few additional boot parameters<footnote> <para> With current kernels (2.6.9 or newer) you can use 32 command line options and 32 environment options. If these numbers are exceeded, the kernel will panic. </para> </footnote> which may be useful.
da: Installationssystemet genkender nogle få yderligere opstartsparametre<footnote> <para> med aktuelle kerner (2.6.9 eller nyere) kan du bruge 32 kommandolinjeindstillinger og 32 miljøindstillinger. Hvis disse tal overskrides går kernen i panik. </para> </footnote> hvilket kan være nyttigt.

source: A number of parameters have a <quote>short form</quote> that helps avoid the limitations of the kernel command line options and makes entering the parameters easier. If a parameter has a short form, it will be listed in brackets behind the (normal) long form. Examples in this manual will normally use the short form too.
da: Et antal parametre har en <quote>kort form</quote> som hjælper med at undgå begrænsningerne i kernens indstillinger for kommandolinjen og gør indtastning af parametre nemmere. Hvis en parameter har en kort form, så vil den blive vist i parenteser bag den (normale) lange form. Eksempler i denne manual vil normalt også bruge den korte form.

source: debconf/priority (priority)
da: debconf/priority (prioritet)

source: This parameter sets the lowest priority of messages to be displayed.
da: Denne parameter angiver den laveste prioritet beskeder kan have for at blive vist.

source: The default installation uses <userinput>priority=high</userinput>. This means that both high and critical priority messages are shown, but medium and low priority messages are skipped. If problems are encountered, the installer adjusts the priority as needed.
da: Standardinstallationen bruger <userinput>priority=high</userinput>. Dette betyder at beskeder med både høj og kritisk prioritet bliver vist, mens beskeder med mellem og lav prioritet udelades. Hvis der opstår problemer, justerer installationsprogrammet prioriteten efter behov.

source: If you add <userinput>priority=medium</userinput> as boot parameter, you will be shown the installation menu and gain more control over the installation. When <userinput>priority=low</userinput> is used, all messages are shown (this is equivalent to the <emphasis>expert</emphasis> boot method). With <userinput>priority=critical</userinput>, the installation system will display only critical messages and try to do the right thing without fuss.
da: Hvis du tilføjer <userinput>priority=medium</userinput> som opstartsparameter, vil du få vist installationsmenuen og opnå yderligere kontrol over installationen. Når <userinput>priority=low</userinput> bruges, vises alle beskeder (dette svarer til opstartsmetoden <emphasis>expert</emphasis>. Med <userinput>priority=critical</userinput> vil installationssystemet kun vise kritiske beskeder og forsøge at udføre tingene korrekt uden hensyn til unødvendige detaljer.

source: This boot parameter controls the type of user interface used for the installer. The current possible parameter settings are: <itemizedlist> <listitem> <para><userinput>DEBIAN_FRONTEND=noninteractive</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=text</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=newt</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=gtk</userinput></para> </listitem> </itemizedlist> The default frontend is <userinput>DEBIAN_FRONTEND=newt</userinput>. <userinput>DEBIAN_FRONTEND=text</userinput> may be preferable for serial console installs. Some specialized types of install media may only offer a limited selection of frontends, but the <userinput>newt</userinput> and <userinput>text</userinput> frontends are available on most default install media. On architectures that support it, the graphical installer uses the <userinput>gtk</userinput> frontend.
da: Denne opstartsparameter kontroller typen af brugergrænseflade brugt af installationsprogrammet. De aktuelt mulige parameterindstillinger er: <itemizedlist> <listitem> <para><userinput>DEBIAN_FRONTEND=noninteractive</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=text</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=newt</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=gtk</userinput></para> </listitem> </itemizedlist> Standardbrugerfladen er <userinput>DEBIAN_FRONTEND=newt</userinput>. <userinput>DEBIAN_FRONTEND=text</userinput> kan foretrækkes for serielle konsolinstallationer. Nogle specialiserede typer af installationsmedier tilbyder måske kun et begrærset udvalg af brugerflader, men brugerfladerne <userinput>newt</userinput> og <userinput>text</userinput> er tilgængelige på de fleste gængse installationsmedier. På arkitekturer som understøtter det, bruger det grafiske installationsprogram brugerfladen <userinput>gtk</userinput>.

source: Setting this boot parameter to 2 will cause the installer's boot process to be verbosely logged. Setting it to 3 makes debug shells available at strategic points in the boot process. (Exit the shells to continue the boot process.)
da: Angivelse af denne opstartsparameter til 2 vil medføre at installationsprogrammets opstartsprogram bliver udførligt logget. Indstilligen 3 vil gøre fejlsøgningsskaller tilgængelige på strategiske steder i opstartsprocessen. (Afslut skallerne for at fortsætte opstartsprocessen).

source: This is the default.
da: Dette er standarden.

source: More verbose than usual.
da: Mere uddybende end normalt.

source: Lots of debugging information.
da: Masser af fejlsøgningsinformation.

source: Shells are run at various points in the boot process to allow detailed debugging. Exit the shell to continue the boot.
da: Skaller køres på forskellige steder i opstartsprocessen for at tillade detaljeret fejlsøgning. Afslut skallen for at fortsætte opstarten.

source: The value of the parameter is the path to the device to load the &debian; installer from. For example, <userinput>INSTALL_MEDIA_DEV=/dev/floppy/0</userinput>
da: Værdien på denne parameter er stien til enehden hvor &debian;-installationsprogrammet skal indlæses fra. For eksempel, <userinput>INSTALL_MEDIA_DEV=/dev/floppy/0</userinput>

source: The boot floppy, which normally scans all floppies it can to find the root floppy, can be overridden by this parameter to only look at the one device.
da: Opstartsdisketten, som normalt skanner alle diskettedrev den kan for at finde roddisketten, kan overskrives med denne parameter til kun at kigge efter en enhed.

source: Causes the installer to send log messages to a remote syslog on the specified host and port as well as to a local file. If not specified, the port defaults to the standard syslog port 514.
da: Får installationsprogrammet til at sende logbeskeder til en ekstern systemlog på den angivne vært og port samt til en lokal fil. Hvis ikke angivet, er portstandarden systemloggens standardport 514.

source: Can be used to force the installer to a lowmem level higher than the one the installer sets by default based on available memory. Possible values are 1 and 2. See also <xref linkend="lowmem"/>.
da: Kan bruges til at tvinge installationsprogrammet til et lowmen-niveau højere end det installationsprogrammet sætter som standard baseret på tilgængelig hukommelse. Mulige værdier er 1 og 2. Se også <xref linkend="lowmem"/>.

source: Prevents the installer from offering interactive shells on tty2 and tty3. Useful for unattended installations where physical security is limited.
da: Forhindrer installationsprogrammet i at tilbyder interaktive skaller på tty2 og tty3. Nyttig for installationer der ikke overvåges og hvor fysisk sikkerhed er begrænset.

source: Some architectures use the kernel framebuffer to offer installation in a number of languages. If framebuffer causes a problem on your system you can disable the feature using the parameter <userinput arch="x86">vga=normal</userinput> <userinput>fb=false</userinput>. Problem symptoms are error messages about bterm or bogl, a blank screen, or a freeze within a few minutes after starting the install.
da: Nogle arkitekturer bruger kerneframebufferen til at tilbyder installation i et antal sprog. Hvis framebuffer medfører et problem på dit system, så kan du deaktivere funktionen med parameteren <userinput arch="x86">vga=normal</userinput> <userinput>fb=false</userinput>. Symptomer på problemer er fejlbeskeder om bterm eller bogl, en blank skærm eller at installationen fryser efter et par minutter.

source: Such problems have been reported on hppa.
da: Disse problemer er blevet indrapporteret på hppa.

source: Because of display problems on some systems, framebuffer support is <emphasis>disabled by default</emphasis> for &arch-title;. This can result in ugly display on systems that do properly support the framebuffer, like those with ATI graphical cards. If you see display problems in the installer, you can try booting with parameter <userinput>debian-installer/framebuffer=true</userinput> or <userinput>fb=true</userinput> for short.
da: På grund af visningsproblemer på nogle systemer, så er understøttelse af framebuffer <emphasis>deaktiveret som standard</emphasis> for &arch-title;. Dette kan medføre visninger, der ikke er så kønne, på systemer som ikke korrekt understøtter framebufferen, såsom med ATI-grafikkort. Hvis du ser problemer i installationsprogrammet, så kan du prøve at starte med parameteren <userinput>debian-installer/framebuffer=true</userinput> eller <userinput>fb=true</userinput> i kort form.

source: debian-installer/theme (theme)
da: debian-installer/theme (tema)

source: A theme determines how the user interface of the installer looks (colors, icons, etc.). What themes are available differs per frontend. Currently both the newt and gtk frontends only have a <quote>dark</quote> theme that was designed for visually impaired users. Set the theme by booting with <userinput>theme=<replaceable>dark</replaceable></userinput>.
da: Et tema bestemmer hvordan brugergrænsefladen for installationsprogrammet ser ud (farver, ikoner etc.). Hvilke temaer der er tilgængelige afviger per brugerflade. Aktuelt har både newt- og gtk-brugerfladerne kun et <quote>dark</quote>-tema, som blev designet for de visuelt synshæmmede brugere. Angiv temaet ved at starte med <userinput>theme=<replaceable>dark</replaceable></userinput>.

source: Set to <userinput>false</userinput> to prevent starting PCMCIA services, if that causes problems. Some laptops are well known for this misbehavior.
da: Sæt til <userinput>false</userinput> for at forhindre opstart af PCMCIA-tjenester, hvis dette medfører problemer. Nogle bærbare er kendt for denne opførsel.

source: Set to <userinput>true</userinput> to enable support for Serial ATA RAID (also called ATA RAID, BIOS RAID or fake RAID) disks in the installer. Note that this support is currently experimental. Additional information can be found on the <ulink url="&url-d-i-wiki;">&debian; Installer Wiki</ulink>.
da: Sæt til <userinput>true</userinput> for aktivere understøttelse for Serial ATA RAID-diske (også kaldt ATA RAID, BIOS RAID eller falsk RAID) i installationsprogrammet. Bemærk at denne understøttelse kun er eksperimentel. Yderligere information kan findes på <ulink url="&url-d-i-wiki;">&debian;-installationsprogrammets wiki</ulink>.

source: preseed/url (url)
da: preseed/url (adresse)

source: Specify the url to a preconfiguration file to download and use for automating the install. See <xref linkend="automatic-install"/>.
da: Angiv adressen for en prækonfigurationsfil for at hente og bruge den for automatisering af installationen. Se <xref linkend="automatic-install"/>.

source: preseed/file (file)
da: preseed/file (fil)

source: Specify the path to a preconfiguration file to load for automating the install. See <xref linkend="automatic-install"/>.
da: Angiv stien til en forhåndskonfigurationsfil til indlæsning for automatisering af installationen. Se <xref linkend="automatic-install"/>.

source: Set to <userinput>true</userinput> to display questions even if they have been preseeded. Can be useful for testing or debugging a preconfiguration file. Note that this will have no effect on parameters that are passed as boot parameters, but for those a special syntax can be used. See <xref linkend="preseed-seenflag"/> for details.
da: Sæt til <userinput>true</userinput> for at vise spørgsmål selv hvis de er blevet forudfyldt. Kan være nyttig for test eller fejlsøgning af en forhåndskonfigureret fil. Bemærk at dette ikke vil have effekt på parametre som sendes som opstartsparametre, men for disse kan en speciel syntaks bruges. Se <xref linkend="preseed-seenflag"/> for detaljer.

source: Delay questions that are normally asked before preseeding is possible until after the network is configured. See <xref linkend="preseed-auto"/> for details about using this to automate installs.
da: Forsink spørgsmål som der normalt stilles før forudfyldning er muligt indtil efter at netværket er konfigureret. Se <xref linkend="preseed-auto"/> for detaljer om brugen af denne til automatisering af installationer.

source: During installations from serial or management console, the regular virtual consoles (VT1 to VT6) are normally disabled in <filename>/etc/inittab</filename>. Set to <userinput>true</userinput> to prevent this.
da: Under installationer fra seriel eller håndteringskonsol er de regulære virtuelle konsoller (VT1 til VT6) normalt deaktiveret i <filename>/etc/inittab</filename>. Sæt til <userinput>true</userinput> for at forhindre dette.

source: By default, before rebooting, &d-i; automatically ejects the optical media used during the installation. This can be unnecessary if the system does not automatically boot off the CD. In some cases it may even be undesirable, for example if the optical drive cannot reinsert the media itself and the user is not there to do it manually. Many slot loading, slim-line, and caddy style drives cannot reload media automatically.
da: Som standard, før genstart, så skubber &d-i; automatisk det optiske medie ud, som blev brugt under installationen. Dette kan være unødvendigt, hvis systemet ikke automatisk starter op fra cd'en. I nogle tilfælde kan det endda være uønsket, for eksempel hvis det optiske drev ikke kan genindsætte mediet selv og hvis brugeren ikke er der til at gøre det manuelt. Mange slot-indlæsende og tynde drev samt drev i caddy-stil kan ikke genindlæse mediet automatisk.

source: Set to <userinput>false</userinput> to disable automatic ejection, and be aware that you may need to ensure that the system does not automatically boot from the optical drive after the initial installation.
da: Sæt til <userinput>false</userinput> for at deaktivere automatisk skub ud, og vær opmærksom på at du skal sikre at systemet ikke automtatisk starter op fra det optiske drev efter den oprindelige installation.

source: base-installer/install-recommends (recommends)
da: base-installer/install-recommends (anbefalinger)

source: By setting this option to <userinput>false</userinput>, the package management system will be configured to not automatically install <quote>Recommends</quote>, both during the installation and for the installed system. See also <xref linkend="di-install-base"/>.
da: Ved at angive denne indstilling til <userinput>false</userinput>, vil pakkehåndteringssystemet blive konfigureret til ikke automatisk at installere <quote>Recommends (anbefalinger)</quote>, både under installationen og for det installerede system. Se også <xref linkend="di-install-base"/>.

source: Note that this option allows to have a leaner system, but can also result in features being missing that you might normally expect to be available. You may have to manually install some of the recommended packages to obtain the full functionality you want. This option should therefore only be used by very experienced users.
da: Bemærk at denne indstilling giver et mindre omfattende system, men kan også resultere i at funktioner mangler, som du ellers normalt ville forvente var tilgængelige. Du skal måske installere nogle af de anbefalede pakker for at få den fulde funktionalitet. Denne indstilling bør derfor kun bruges af meget erfarne brugere.

source: By default the installer requires that repositories be authenticated using a known gpg key. Set to <userinput>true</userinput> to disable that authentication. <emphasis role="bold">Warning: insecure, not recommended.</emphasis>
da: Som standard kræver installationsprogrammet at arkiver godkendes med en kendt gpg-nøgle. Angiv som <userinput>true (sand)</userinput> for at deaktivere den godkendelse. <emphasis role="bold">Advarsel: usikker, kan ikke anbefales.</emphasis>

source: This parameter should already be set to a correct value where needed; set it only it you see errors during the boot that indicate the ramdisk could not be loaded completely. The value is in kB.
da: Denne parameter bør allerede være angivet til en korrekt værdi hvor krævet; angiv den kun hvis du ser fejl under opstarten som indikerer at ramdisk ikke kunne indlæses fuldt ud. Værdien er i kB.

source: Set to <userinput>true</userinput> to enter rescue mode rather than performing a normal installation. See <xref linkend="rescue"/>.
da: Angiv til <userinput>true (sand)</userinput> for at gå i redningstilstand fremfor at udføre en normal installation. Se <xref linkend="rescue"/>.

source: Using boot parameters to answer questions
da: Brug af opstartsparametre til at besvare spørgsmål

source: With some exceptions, a value can be set at the boot prompt for any question asked during the installation, though this is only really useful in specific cases. General instructions how to do this can be found in <xref linkend="preseed-bootparms"/>. Some specific examples are listed below.
da: Med nogle undtagelser, kan en værdi angives ved opstartsprompten for spørgsmål stillet under installationen, dog er dette kun virkelig nyttigt i specifikke tilfælde. Generelle instruktioner om hvordan dette udføres kan findes i <xref linkend="preseed-bootparms"/>. Nogle specifikke eksempler vises nedenfor.

source: debian-installer/language (language)
da: debian-installer/language (sprog)

source: debian-installer/country (country)
da: debian-installer/country (land)

source: debian-installer/locale (locale)
da: debian-installer/locale (sted)

source: There are two ways to specify the language, country and locale to use for the installation and the installed system.
da: Der er to måder at angive sproget på, land og sted at bruge for installationen og det installerede system.

source: The first and easiest is to pass only the parameter <literal>locale</literal>. Language and country will then be derived from its value. You can for example use <userinput>locale=de_CH</userinput> to select German as language and Switzerland as country (<literal>de_CH.UTF-8</literal> will be set as default locale for the installed system). Limitation is that not all possible combinations of language, country and locale can be achieved this way.
da: Den første og nemmeste måde er kun at sende parameteren <literal>locale</literal>. Sprog og land vil så blive udledt fra dens værdi. Du kan for eksempel bruge <userinput>locale=de_CH</userinput> til at vælge tysk som sprog og Schweitz som land (<literal>de_CH.UTF-8</literal> vil blive angivet som standardsted for det installerede system). Begrænsningen er at ikke alle mulige kombinationer af sprog, land og sted kan opnås på denne måde.
