Repository: kaplanlior/debian-installer
Catalog: manual/po/*/boot-installer.po
Languages: da

source: There are some common installation problems that can be solved or avoided by passing certain boot parameters to the installer.
da: Der er nogle gængse installationsproblemer, som kan løses eller undgås ved at sende bestemte opstartsparametre til installationsprogrammet.

source: If your screen begins to show a weird picture while the kernel boots, eg. pure white, pure black or colored pixel garbage, your system may contain a problematic video card which does not switch to the framebuffer mode properly. Then you can use the boot parameter <userinput>fb=false</userinput> to disable the framebuffer console. Only a reduced set of languages will be available during the installation due to limited console features. See <xref linkend="boot-parms"/> for details.
da: Hvis din skærm begynder at vise et underligt billede når kernen starter op, f.eks. ren hvid, ren sort eller usammenhængende farvede billedpunkter, så kan dit system indeholde et problematisk videokort, som ikke skifter til tilstanden for framebuffer korrekt. Så kan du bruge opstartsparameteren <userinput>fb=false</userinput> til at deaktivere framebuffer-konsollen. Kun et reduceret sæt af sprog vil være tilgængelige under installationen på grund af begrænsede konsolfunktioner. Se <xref linkend="boot-parms"/> for detaljer.

source: System Freeze During the PCMCIA Configuration Phase
da: Systemfrysning under PCMCIA-konfigurationsfasen

source: Some very old laptop models produced by Dell are known to crash when PCMCIA device detection tries to access some hardware addresses. Other laptops may display similar problems. If you experience such a problem and you don't need PCMCIA support during the installation, you can disable PCMCIA using the <userinput>hw-detect/start_pcmcia=false</userinput> boot parameter. You can then configure PCMCIA after the installation is completed and exclude the resource range causing the problems.
da: Nogle meget gamle bærbare modeller fremstillet af Dell vides at bryde ned når PCMCIA-enhedsdetektering forsøger at tilgå udvalgte udstyrsadresser. Andre bærbare kan have lignende problemer. Hvis du oplever et sådant problem har du ikke brug for PCMCIA-understøttelse under installationen, så kan du deaktivere PCMCIA via opstartsparameteren <userinput>hw-detect/start_pcmcia=false</userinput>. Du kan så konfigurere PCMCIA efter at installationen er færdig og ekskludere ressourceintervallet, der medfører problemerne.

source: Alternatively, you can boot the installer in expert mode. You will then be asked to enter the resource range options your hardware needs. For example, if you have one of the Dell laptops mentioned above, you should enter <userinput>exclude port 0x800-0x8ff</userinput> here. There is also a list of some common resource range options in the <ulink url="http://pcmcia-cs.sourceforge.net/ftp/doc/PCMCIA-HOWTO-1.html#ss1.12">System resource settings section of the PCMCIA HOWTO</ulink>. Note that you have to omit the commas, if any, when you enter this value in the installer.
da: Alternativt kan du starte installationsprogrammet op i eksperttilstand. Du vil så blive spurgt om at indtaste ressourceintervallet som dit udstyr kræver. For eksempel, hvis du har en af Dells bærbare nævnt ovenfor, skal du indtaste <userinput>exclude port 0x800-0x8ff</userinput>. Der er også en liste over nogle gængse intervalindstillinger for ressourcer i afsnittet for <ulink url="http://pcmcia-cs.sourceforge.net/ftp/doc/PCMCIA-HOWTO-1.html#ss1.12">Systemressourceindstillinger for PCMCIA - hjælp</ulink>.

source: There are some common installation problems that are worth mentioning.
da: Der er nogle gængse installationsproblemer som det er værd at nævne.

source: Misdirected video output
da: Fejlramt videoresultat

source: It is fairly common for &arch-title; to have two video cards in one machine, for example an ATI card and a Sun Creator 3D. In some cases, this may result in the video output getting misdirected soon after the system boots. In typical cases, the display will only show: <informalexample><screen> Remapping the kernel... done Booting Linux... </screen></informalexample> To work around this, you can either pull out one of the video cards, or disable the one not used during the OpenProm boot phase using a kernel parameter. For example, to disable an ATI card, you should boot the installer with <userinput>video=atyfb:off</userinput>.
da: Det er ret ofte at &arch-title; har to videokort i en maskine, for eksempel et ATI-kort og et Sun Creator 3D. I nogle tilfælde, kan dette resultere i at videoresultatet bliver fejlramt efter at systemet starter op. i typiske tilfælde vil skærmen kun vise: <informalexample><screen> Remapping the kernel... done Booting Linux... </screen></informalexample> For at omgå dete kan du enten fjerne et af videokortene eller deaktivere et af dem under OpenProm-opstartsfasen med en kerneparameter. For eksempel, for at deaktivere et ATI-kort, skal du starter installationsprogrammet op med <userinput>video=atyfb:off</userinput>.

source: Note that you may also have to manually add this parameter to the silo configuration (edit <filename>/target/etc/silo.conf</filename> before rebooting) and, if you installed X11, modify the video driver in <filename>/etc/X11/xorg.conf</filename>.
da: Bemærk at du måske også manuelt skal tilføje denne paramter til silo-konfigurationen (rediger <filename>/target/etc/silo.conf</filename> før genstart) og, hvis du installerede X11, så ændr videodriveren i <filename>/etc/X11/xorg.conf</filename>.

source: Failure to Boot or Install from CD-ROM
da: Fejl ved opstart eller installation fra cd-rom

source: Some Sparc systems are notoriously difficult to boot from CD-ROM and even if they do boot, there may be inexplicable failures during the installation. Most problems have been reported with SunBlade systems.
da: Nogle Sparc-systemer er notorisk svære at starte fra cd-rom og selv om de starter op, kan der være fejl der ikke kan forklare under installationen. De fleste problemer er blevet indrapporteret med SunBlade-systemer.

source: We recommend to install such systems by netbooting the installer.
da: Vi anbefaler at installere sådanne systemer ved at netopstarte installationsprogrammet.

source: Interpreting the Kernel Startup Messages
da: Fortolker kernens opstartsbeskeder

source: During the boot sequence, you may see many messages in the form <computeroutput>can't find <replaceable>something</replaceable></computeroutput>, or <computeroutput><replaceable>something</replaceable> not present</computeroutput>, <computeroutput>can't initialize <replaceable>something</replaceable></computeroutput>, or even <computeroutput>this driver release depends on <replaceable>something</replaceable></computeroutput>. Most of these messages are harmless. You see them because the kernel for the installation system is built to run on computers with many different peripheral devices. Obviously, no one computer will have every possible peripheral device, so the operating system may emit a few complaints while it looks for peripherals you don't own. You may also see the system pause for a while. This happens when it is waiting for a device to respond, and that device is not present on your system. If you find the time it takes to boot the system unacceptably long, you can create a custom kernel later <phrase arch="linux-any">(see <xref linkend="kernel-baking"/>)</phrase>.
da: Under opstartssekvensen, kan du se beskeder i form af <computeroutput>kan ikke finde <replaceable>et eller andet</replaceable></computeroutput> eller <computeroutput><replaceable>noget</replaceable> er ikke til stede</computeroutput>, <computeroutput>kan ikke initialisere <replaceable>noget</replaceable></computeroutput>, eller endda <computeroutput>denne driverudgivelse afhænger af <replaceable>et eller andet</replaceable></computeroutput>. De fleste af disse beskeder er harmløse. Du ser dem fordi kernen for installationssystemet er bygget til at køre på computere med mange forskellige perifære enheder. Det er indlysende at ikke alle computere har hver eneste perifære enhed, så operativsystemet kan give nogle få beklagelser, når det leder efter perifære enheder, du ikke har. Du kan også se at systemet kan gå i pause i et øjeblik. Dette sker når systemet venter på at en enhed svarer, og denne enhed ikke er tilgængelig på dit system. Hvis du synes at tiden systemet er om at starte op er for lang, så kan du oprette en tilpasset kerne senere <phrase arch="linux-any">(see <xref linkend="kernel-baking"/>)</phrase>.

source: Reporting Installation Problems
da: Rapportering af installationsproblemer

source: If you get through the initial boot phase but cannot complete the install, the menu option <guimenuitem>Save debug logs</guimenuitem> may be helpful. It lets you store system error logs and configuration information from the installer to a floppy, or download them using a web browser. This information may provide clues as to what went wrong and how to fix it. If you are submitting a bug report, you may want to attach this information to the bug report.
da: Hvis du kommer igennem den indledende opstartsfase men ikke kan færdiggøre installationen, så kan menupunktet <guimenuitem>Gem fejlsøgningslog</guimenuitem> være nyttig. Punktet lader dig gemme fejllog fra systemet og konfigurationsinformation fra installationsprogrammet til en diskette eller hente dem med en internetbrowser. Denne information kan give ideer til hvad der gik galt og hvordan det rettes. Hvis du indsender en fejlrapport, så kan du vedhæfte denne information til fejlrapporten.

source: Other pertinent installation messages may be found in <filename>/var/log/</filename> during the installation, and <filename>/var/log/installer/</filename> after the computer has been booted into the installed system.
da: Andre relevante installationsbeskeder kan findes i <filename>/var/log/</filename> under installationen og <filename>/var/log/installer/</filename> efter at computeren er blevet startet op i det installerede system.

source: Submitting Installation Reports
da: Indsendelse af installationsrapporter

source: If you still have problems, please submit an installation report. We also encourage installation reports to be sent even if the installation is successful, so that we can get as much information as possible on the largest number of hardware configurations.
da: Hvis du stadig har problemer, så indsend en installationsrapport. Vi opmuntrer også til, at installationsrapporter indsendes selvom installationen lykkes, så vi kan få så meget information som muligt om det største antal udstyrskonfigurationer.

source: Note that your installation report will be published in the Debian Bug Tracking System (BTS) and forwarded to a public mailing list. Make sure that you use an e-mail address that you do not mind being made public.
da: Bemærk at din installationsrapport vil blive vist i Debians fejlsøgningssystem (BTS) og videresendt til en offentlig postliste. Sikr dig at du bruger en e-post-adresse, som du ikke har problemer med er offentlig.

source: If you have a working &debian; system, the easiest way to send an installation report is to install the <classname>installation-report</classname> and <classname>reportbug</classname> packages (<command>aptitude install installation-report reportbug</command>), configure <classname>reportbug</classname> as explained in <xref linkend="mail-outgoing"/>, and run the command <command>reportbug installation-reports</command>.
da: Hvis du har et fungerende &debian;-system, så er den nemmeste måde at sende en installationsrapport at installere pakkerne <classname>installation-report</classname> og <classname>reportbug</classname> (<command>aptitude install installation-report reportbug</command>), konfigurere <classname>reportbug</classname> som forklaret i <xref linkend="mail-outgoing"/>, og køre kommandoen <command>reportbug installation-reports</command>.

source: Alternatively you can use this template when filling out installation reports, and file the report as a bug report against the <classname>installation-reports</classname> pseudo package, by sending it to <email>submit@bugs.debian.org</email>. <informalexample><screen> Package: installation-reports Boot method: &lt;How did you boot the installer? CD? floppy? network?&gt; Image version: &lt;Full URL to image you downloaded is best&gt; Date: &lt;Date and time of the install&gt; Machine: &lt;Description of machine (eg, IBM Thinkpad R32)&gt; Processor: Memory: Partitions: &lt;df -Tl will do; the raw partition table is preferred&gt; Output of lspci -knn (or lspci -nn): Base System Installation Checklist: [O] = OK, [E] = Error (please elaborate below), [ ] = didn't try it Initial boot: [ ] Detect network card: [ ] Configure network: [ ] Detect CD: [ ] Load installer modules: [ ] Detect hard drives: [ ] Partition hard drives: [ ] Install base system: [ ] Clock/timezone setup: [ ] User/password setup: [ ] Install tasks: [ ] Install boot loader: [ ] Overall install: [ ] Comments/Problems: &lt;Description of the install, in prose, and any thoughts, comments and ideas you had during the initial install.&gt; </screen></informalexample> In the bug report, describe what the problem is, including the last visible kernel messages in the event of a kernel hang. Describe the steps that you did which brought the system into the problem state.
da: Alternativt kan du bruge denne skabelon når du udfylder installationsrapporter, og indsende rapporten som en fejlrapport mod pseudopakken <classname>installation-reports</classname> ved at sende den til <email>submit@bugs.debian.org</email>. <informalexample><screen> Pakke: installation-reports Boot method: &lt;Hvordan igangsatte du installationsprogrammet? cd? diskette? netværk?&gt; Image version: &lt;Fuld adresse til aftrykket du hentede er bedst&gt; Date: &lt;Dato og tidspunkt for installationen&gt; Machine: &lt;Beskrivelse af maskine (f.eks. IBM Thinkpad R32)&gt; Processor: Memory: Partitions: &lt;df -Tl er nok; den rå partitionstabel foretrækkes&gt; Resultat af lspci -knn (eller lspci -nn): Afkrydsningsliste for installation af basissystemet: [O] = O.k., [E] = Fejl (uddyb venligst nedenfor), [ ] = prøvede det ikke Initial boot: [ ] Detect network card: [ ] Configure network: [ ] Detect CD: [ ] Load installer modules: [ ] Detect hard drives: [ ] Partition hard drives: [ ] Install base system: [ ] Clock/timezone setup: [ ] User/password setup: [ ] Install tasks: [ ] Install boot loader: [ ] Overall install: [ ] Comments/Problems: &lt;Beskrivelse af installationen, i tekst, og eventuelle tanker, kommentarer og ideer du havde under den oprindelige installation.&gt; </screen></informalexample> I fejlrapporten beskriver du hvad problemet er, inklusiv den sidst synlige kernebesked i tilfælde af at kernen hænger. Beskriv handlingerne, du foretog dig, som førte til systemets fejltilstand.
